{
  "content": {
    "NONE": "",
    "MISSION_OK": "The customer is satisfied with the job. There has been an income in your account.",
    "MISSION_INTR_FAILED": "The victim has discovered the intrusion, the job is canceled.",
    "MISSION_NO_COMPLETED": "You have not completed the order requirements, the mission is still active.",
    "MISSION_ANY_USER": "The client wants the login credentials of any user.",
    "MISSION_SPECIFIC_USER": "The client wants the login credentials of a particular user.",
    "MISSION_CREDENTIALS": "Credentials",
    "MISSION_CREDENTIALS_TITLE": "Credentials needed",
    "MISSION_CREDENTIALS_CONTENT": "Client wants to access to the remote machine.",
    "MISSION_ACADEMIC_TITLE": "Academic changes",
    "MISSION_ACADEMIC_CONTENT": "Client wants to change some grades in his academic record.",
    "MISSION_ACADEMIC_CHANGES": "It is necessary that you infiltrate in the network to modify some data.",
    "MISSION_TARGET_NOT_FOUND": "The victim's computer is not online. Mission canceled.",
    "TUTO1": "The system has been installed correctly.\n\nFeel free to explore your computer. When you are ready, check the <color=#0FABFFFF>Manual</color> for more information about how to connect to a network.\n\nTo access the <color=#0FABFFFF>Manual</color>, double-click on the <color=#0FABFFFF>Manual</color> icon located on the <color=#33cccc>desktop</color>.\n\nYou can also access the <color=#0FABFFFF>Manual</color> by clicking on the button located in the upper left corner, then click on the <color=orange>Help</color> entry.",
    "AIRMON_USAGE": "<b>Usage: airmon [start:stop] [net interface]</b>\nExample: airmon start wlan0",
    "AIRMON_DETAIL": "Used to enable <color=orange>monitor mode</color> on wireless interfaces. \nIt may also be used to go back from <color=orange>monitor mode</color> to <color=orange>managed mode</color>. \nEntering the <color=#0FABFFFF>airmon</color> command without parameters will show the interfaces status.",
    "AIRMON_HELP": "It is the first step to be able to get the connection <color=orange>password</color> of a wifi router. The network card needs to be activated in <color=orange>monitor mode</color>.",
    "AIREPLAY_USAGE": "<b>Usage: aireplay [-b bssid] [-e essid]</b>",
    "AIREPLAY_DETAIL": "Used to inject frames on wireless interfaces. The primary function is to generate traffic for the later use in <color=#0FABFFFF>aircrack</color> for cracking the router keys.",
    "AIREPLAY_HELP": "<mark=#00D0124D><b>[Usage Details]</b></mark>\n\nOnce you have selected a network you can launch the command to start capturing the necessary data to crack the password.\nExample: <color=#0FABFFFF><color=#0FABFFFF>aireplay</color> -b 14:C7:E5:46:D9:F5 -e corpdevice</color>\n\nIn case of failure, it will mean that the router is patched against this vulnerability.\n\nOnce the command is executed, wait for a minimum number of packets, <color=orange>ACKs</color>, to be generated. With a good network power, at least 7,000 packages would be enough. For the low power networks you may need as much as 20k acks\nOnce you have reached the desired number of packets, press <color=#33cccc>Control + C</color> to stop the process and save the information in a text file.\nThis file will be in the same folder where the <color=#0FABFFFF>aireplay</color> command was executed.",
    "AIRCRACK_DETAIL": "Key cracking program",
    "AIRCRACK_USAGE": "<b>Usage: aircrack [file cap]</b>",
    "AIRCRACK_HELP": "Use with the file generated by aireplay.",
    "NMAP_DETAIL": "Scan remote ips to find open ports.",
    "NMAP_USAGE": "<b>Usage: nmap [ip address]</b>\nExample: nmap 127.0.0.1",
    "SMTPUSERLIST_DETAIL": "Displays the user accounts registered on the server where the <color=orange>SMTP</color> service is running. The program also shows if those user accounts have an email account associated with the <color=orange>SMTP</color> server.",
    "ING_TITLE_ADMIN_ACTION": "Administrative action",
    "ING_TITLE_LOGIN_ISSUES": "Login issues",
    "ING_TITLE_NEW_IN_COMPANY": "I'm new in the company",
    "ING_TITLE_LOOK_THIS": "Hey look at this!",
    "ING_ADMIN_ACTION": "Hello,\nI am the administrator <NAME_ADMIN>. There was a problem with the login servers. \n\nI need you to give me your password to solve it, otherwise I would have to proceed to completely erase your account to create it again and you would lose all your data.\n\nPlease,\ncontact me as soon as possible.",
    "ING_LOGIN_ISSUES": "Hello, I'm <NAME>. I don't know what happens today that I can't enter into my workstation. \n\nI get the \"wrong password\" error all the time. I'm sure that I'm entering my password correctly. What I can do?\n\nThank you.<SIGN>",
    "ING_NEW_IN_COMPANY": "Hello <NAME_ADMIN>, My name is <NAME>. I am new to the company. I was told that I would have an <ACCOUNT_TYPE> account on the network so I could start working.\nBut no one has given me any information to enter. Can you help me?",
    "ING_LOOK_THIS": "Look at this game, is great! <LINK_EXEC>",
    "TUTO_TITLE_MAIL_HACK": "I'm watching you",
    "TUTO_MAIL_HACK_OK": "You have done well. If you want to work you may want to visit this web <b>[IP_HACKSHOP]</b>",
    "MISSION_MODIFY_REG": "The record to modify belongs to:",
    "MISSION_CLIENT_REG": "Client wants to modify the subject",
    "MISSION_SUBJECT_APPROVED": "to change the note to approved at least.",
    "MISSION_SUBJECT_IMPROVED": "to increase the academic qualification by at least one point",
    "MAIL_PASSWORD_1": "Hey $username_to! this does not work! I try to access but it will not let me ...",
    "MAIL_ANSWER_1": "Yes wait, I was resetting the password, the new one is $mailpass_to",
    "MAIL_ANSWER_2": "ok!",
    "MAIL_ANSWER_3": "Have you tried the old one?",
    "MAIL_ANSWER_4": "Yes and nothing ...",
    "MAIL_ANSWER_5": "Oops, it has been reset, try $mailpass_to",
    "MAIL_PASSWORD_2": "Hey man, here the new password, delete this mail when you read it, user: $user_to password: $user_pass_to IP: $ip_to",
    "MAIL_PASS_TITLE_1": "Technical help",
    "MAIL_PASS_TITLE_2": "Credentials not working?",
    "MANUAL_INTRODUCTION": "<mark=#00D0124D><b>[Welcome]</b></mark>\n\nPlease, click on any <color=orange>category</color> in the left column to show the list of commands. Then select any command to see the detailed information.\n\nThe entries in the manual only show the help of the commands and programs that are on your computer.\n\nCheck this manual to see detailed information about a new downloaded or installed program.",
    "SSH_USAGE": "<b>Usage: ssh [user@password] [ip address] [(opt) port]</b>\nExample: ssh John@Connor 127.0.0.1\nExample: ssh John@Connor 127.0.0.1 22",
    "SSH_DETAIL": "Access to private servers through a back door.",
    "SSH_HELP": "Once correctly connected to the remote machine, the user can use the terminal to move through the file system of the remote machine, as well as execute commands and programs that are on that machine.\n\nTo be able to download files <color=#0FABFFFF>ssh</color> use the command <color=#0FABFFFF><color=#0FABFFFF>scp</color> -d file</color>.\nAnd to upload <color=#0FABFFFF><color=#0FABFFFF>scp</color> -u file</color>.\n\nThe <color=#0FABFFFF>scp</color> command can only be used when connected using <color=#0FABFFFF>ssh</color>.\n\n<mark=#00D0124D><b>[<color=#0FABFFFF>ssh</color> encryption]</b></mark>\n\nThe <color=#0FABFFFF>ssh</color> servers can encrypt the connections to prevent the real password from being captured by sniffers.\n\nTo activate encryption, just edit the <color=#0FABFFFF>/server/conf/<color=#0FABFFFF>ssh</color>d.conf</color> file and change the <color=orange>enabled_encryption</color> variable to <color=orange>true</color>.\n\nIn that file you can see the path used by the scripts to encode and decode. This algorithm is the one used by default and can be replaced by any other method.\n\nThe only requirement is that the encode and decode scripts must have a function called <color=orange>Encode=function(password)</color> and <color=orange>Decode=function(password)</color> respectively. In addition, these functions must return a string. Finally, the scripts must be compiled for the system to work.\n\nHere is the source code of the algorithms used by default.\n\n<mark=#00D0124D><b>[Encode source]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">\nEncode = function(password)\n    caesar = function(pass, type)\n        nr = pass.len%10\n        crypt = function(char, nr, type)\n            if type == \"enc\" then return char+nr\n            if type == \"dec\" then return char-nr\n        end function    \n        out = []\n        for i in range(0, pass.len-1)\n            c = pass[i].code    \n            if c >= 48 and c <= 57 then \n                c = crypt(c, nr, type)\n                if c < 48 then c = c+10\n                if c > 57 then c = c-10    \n            else if c >= 65 and c <= 90 then \n                c = crypt(c, nr, type)\n                if c < 65 then c = c+26\n                if c > 90 then c = c-26\n            else if c >= 97 and c <= 122 then \n                c = crypt(c, nr, type)\n                if c < 97 then c = c+26\n                if c > 122 then c = c-26\n            end if        \n            out.push(char(c))\n        end for\n        return out.join(\"\")\n    end function\n    output = caesar(password, \"enc\")\n    return output\nend function</font>\n\n<mark=#00D0124D><b>[Decode source]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">\nDecode = function(password)\n    caesar = function(pass, type)\n        nr = pass.len%10\n        crypt = function(char, nr, type)\n            if type == \"enc\" then return char+nr\n            if type == \"dec\" then return char-nr\n        end function    \n        out = []\n        for i in range(0, pass.len-1)\n            c = pass[i].code    \n            if c >= 48 and c <= 57 then \n                c = crypt(c, nr, type)\n                if c < 48 then c = c+10\n                if c > 57 then c = c-10    \n            else if c >= 65 and c <= 90 then \n                c = crypt(c, nr, type)\n                if c < 65 then c = c+26\n                if c > 90 then c = c-26\n            else if c >= 97 and c <= 122 then \n                c = crypt(c, nr, type)\n                if c < 97 then c = c+26\n                if c > 122 then c = c-26\n            end if        \n            out.push(char(c))\n        end for\n        return out.join(\"\")\n    end function\n    output = caesar(password, \"dec\")\n    return output\nend function</font>",
    "TERMINAL_USAGE": "<mark=#00D0124D><b>[Basic usage]</b></mark>\n\nTo move between the terminal folders, use the <color=#0FABFFFF>cd</color> command, for example <color=#0FABFFFF><color=#0FABFFFF>cd</color> folder</color>.\n\nYou can use the <color=orange>autocomplete</color> function by pressing the <color=#33cccc>TAB</color> key so that the terminal finishes typing the command. If there is more than one match, a list is displayed.\n\nTo view the contents of a text file you can use the <color=#0FABFFFF>cat</color> command, for example:\n<color=#0FABFFFF><color=#0FABFFFF>cat</color> file.txt</color>.\n\nThere are certain commands that leave the terminal busy, preventing you from entering new commands until it is finished.\nTo cancel a command press <color=#33cccc>Control+C</color>.\n\n<mark=#00D0124D><b>[Copy and <color=orange>paste</color>]</b></mark>\n\nYou have 3 ways to <color=orange>copy</color> and <color=orange>paste</color> in the terminal. You can choose the one that is most comfortable for you.\n\n<color=orange>QuickEdit</color>\n\nIt is the fastest way. Select the text you want to <color=orange>copy</color> in the terminal by clicking with the left mouse button and dragging.\nOnce you have the selected text, press the middle mouse button to <color=orange>paste</color> the selected text.\n\n<color=orange>Key shortcut</color>\n\nSince <color=#33cccc>Control+C</color> is reserved for canceling active commands, you can <color=orange>copy</color> and <color=orange>paste</color> in the terminal with <color=#33cccc>Control+Shift+C</color> and <color=#33cccc>Control+Shift+V</color>\n\n<color=orange>Contextual menu</color>\n\nSelect the text you want to <color=orange>copy</color> in the terminal by clicking with the left mouse button and dragging. Once the text has been selected, press the right mouse button to show the context menu and press <color=orange>copy</color>.\n\nTo <color=orange>paste</color> text press the right mouse button anywhere in the terminal window to show the context menu, then select the <color=orange>paste</color> option.\n\n<mark=#00D0124D><b>[Running Programs]</b></mark>\n\nA command can be run from any folder on the terminal if it is in the <color=yellow>/bin</color> path or in the <color=yellow>/usr<color=yellow>/bin</color></color> path.\nTherefore it is advisable to move any downloaded program to one of those lo<color=#0FABFFFF>cat</color>ions or it can only be executed from the folder where it is.",
    "ING_NO_PERSON": "There is no one with that name that works here.",
    "ING_PASS_SESSION": "Hi, I just checked the status of the network and everything seems correct.\nHave you checked that your user and password is correct? \n\nThese are the credentials of your computer:\nUser: [USER]\nPassword: [PASSWORD]",
    "ING_ADMIN_MAD": "Are you kidding me!?\nThat person is me !! Who you are?",
    "ING_WRONG_PERSON": "I think that you're writing to the wrong person...",
    "HELLO": "Hello",
    "ING_PASS_HERE": "Here is my password:",
    "GOODBYE": "Regards.",
    "ING_USER_MAD": "Who are you? I don't know anyone by that name. And I will not give you my password!",
    "ING_ADMIN_THREAT": "Who are you?? I am the system administrator. Trying to steal credentials? You're going to shit!",
    "MANUAL_TRACE": "<mark=#00D0124D><b>[General]</b></mark>\n\nWhen you access a remote computer without authorization it is very likely that you will attract the attention of the system administrator.\n\nIf it finds the machine that started the hacking, it will inform the authorities.\nDepending on the type of network you have accessed, administrators can be more or less permissive. \n\nA good administrator usually finds suspicious activity where others do not see it or simply ignore it.\n\nIn any case, it is highly recommended that you delete your tracks once you have finished an intrusion. \nAll computers keep a log of the log in <color=yellow>/var</color>/<color=yellow>system.log</color>.\n\nIn it, system events are registered, such as incoming or outgoing connections, deletion of files, etc.\n\n<mark=#00D0124D><b>[Log file]</b></mark>\n\nTo open the <color=yellow>system.log</color> file you need to use a visual program <color=#0FABFFFF>LogViewer.exe</color> (in future updates there will be a terminal version).\n\nTo do this from the terminal where you are connected to a remote computer, execute the command LogView.exe.\nYou can open graphic applications from the remote computer.\n\nNext, launch the <color=#0FABFFFF>FileExplorer.exe</color> application. Go to the <color=yellow>/var</color> folder and double click on the <color=yellow>system.log</color> file.\n\nIt is important to keep in mind that the deletion of the records is only useful when a <color=orange>passive trace</color> occurs.\n\nThere are two types of traces an administrator can perform: <color=orange>Active trace</color> and <color=orange>Passive trace</color>.\n\n<mark=#00D0124D><b>[Active Trace]</b></mark>\n\nIt occurs only when the administrator of a system is logged into the computer you have accessed. \nThe way to stop this tracking if it has already started is to disconnect from the remote machine, at which point the <color=orange>passive trace</color> will begin.\n\nSystem administrators, like any other worker, have a work schedule.\nIt is usually advisable to access remote machines at times when the administrator is not working.\n\nTo know if an administrator or any other user is present in a system you can use the ps command. If there is a process called dsession it means that the user to whom the process belongs is active on the machine.\n\nPrograms like <color=#0FABFFFF>AdminMonitor</color> notify you in an automated way when an administrator is present and the approximate time remaining until an <color=orange>active trace</color> reaches you.\n\n<mark=#00D0124D><b>[Passive Trace]</b></mark>\n\nIt occurs after a failed <color=orange>active trace</color>, or when the administrator goes to work and checks the logs to find suspicious activity. \nThe records of the systems by which the intruder has been jumping until arriving at the origin are analyzed.\n\nIt is advisable to break the chain of connections at any point so that the administrator can not reach you.\nThese types of traces are much slower than <color=orange>active trace</color>s.\n\n<mark=#00D0124D><b>[How to avoid being caught]</b></mark>\n\nIt is important that you remove any traces that may incriminate you in an unauthorized connection. In the current version of the game you just have to delete any entry in the file <color=yellow>/var</color>/<color=yellow>system.log</color> that is either <color=#33cccc>shell obtained</color> or <color=#33cccc>file deleted</color> along with your IP address.\n\nIf the <color=#0FABFFFF>AdminMonitor</color> program warns you that a admin has started an <color=orange>active trace</color> against you it is important that you try to delete the indicated entries and disconnect before the end of the countdown. \n\nDo not delete the entire log, since inevitably when you disconnect from the machine you will create an entry in the log with your disconnection, creating the file if you had deleted it.\n\nIf an administrator sees a log file with only a disconnect entry, he will suspect and start the trace against you.\n\n<mark=#00D0124D><b>[How to avoid being caught]</b></mark> (advanced)\n\nKeep in mind that if you connect directly to the victim machine, you will not have much reaction time if an administrator starts tracking you. \n\nIt is advisable to use at least one computer to connect to the victim. For example, if you have a rented computer, you can connect to it and from there to the victim machine. In that case you are using a <color=orange>bounce</color> to connect to the remote machine.\n\nYou can use as many computers as you want to create these chains of connections (<color=orange>bounce</color>s) until you reach the victim.\n\nIn this way, the more <color=orange>bounce</color>s you use, the administrator who is tracking you more time will spend to reach you.\n\nThen to eliminate your traces you can completely delete the file <color=yellow>/var</color>/<color=yellow>system.log</color> from any machine you have used as a <color=orange>bounce</color>.\n\nOr alternatively you can also remove from the log of any <color=orange>bounce</color> the entry that indicates a <color=#33cccc>redirection</color> from one ip to the next <color=orange>bounce</color>. ",
    "SMTPUSERLIST_HELP": "SMTP services are mail services. By using the <color=#0FABFFFF>smtp-user-list</color> command with the <color=orange>IP</color> of a mail server, due to a vulnerability in the service, it returns a list of the existing users in the computer where the SMTP service is working. If these users also have registered an email account in the SMTP server, it will be indicated in the list.",
    "SMTPUSERLIST_USAGE": "<b>Usage: smtp-user-list [ip address] [(opt) port]</b>\nExample: smtp-user-list 127.0.0.1",
    "SCP_USAGE": "<b>Usage for download: scp -d [path to remote file/folder]\nUsage for upload: scp -u [name of local file/folder]</b>",
    "MV_USAGE": "<b>Usage: mv [path to file] [path to new folder]</b>",
    "RM_USAGE": "<b>Usage: rm [file]</b>",
    "CP_USAGE": "<b>Usage: cp [path to file] [path to copy]</b>",
    "CAT_USAGE": "<b>Usage: cat [file]</b>",
    "WHOIS_USAGE": "<b>Usage: whois [net address]</b>",
    "IWLIST_USAGE": "<b>Usage: iwlist [net device]</b>\nExample: iwlist wlan0",
    "DECIPHER_USAGE": "<b>Usage: decipher [encrypted file]</b>",
    "MKDIR_USAGE": "<b>Usage: mkdir [path to new folder]</b>\nExample: mkdir newFolder",
    "CHMOD_USAGE": "<b>Usage: chmod [opt:-R] [u,g,o+wrx] [path file/folder]</b>\nExample: chmod u-rx document.txt",
    "EXPORT_USAGE": "<b>export remote display: export DISPLAY=:0</b>",
    "SHELLMAIL_USAGE": "<b>Usage: shellmail [user@password] [ip adress] [(opt) port]</b>",
    "SHELLWEB_USAGE": "<b>Usage: shellweb [ip address] [(opt) port]</b>",
    "SSHGUEST_USAGE": "<b>Usage: sshguest [ip address] [(opt) port]</b>",
    "SSHGUEST_DETAIL": "It allows to enter with a guest account in an <color=#0FABFFFF>ssh</color> server.",
    "SHELLMAIL_DETAIL": "Using the credentials of any user registered in the <color=#0FABFFFF>smtp</color> server, it provides access to a remote <color=orange>shell</color> due to a vulnerability in the <color=#0FABFFFF>smtp</color> service.",
    "SHELLWEB_DETAIL": "Obtain a remote <color=orange>shell</color>, with a guest account, exploiting a vulnerability in the <color=#0FABFFFF>http</color> service.",
    "SSHESCALE_DETAIL": "It allows to scale privileges on a machine to obtain <color=orange>administrator</color> privileges using a <color=#0FABFFFF>ssh</color> server vulnerability.",
    "WEB3XPLOIT_DETAIL": "It allows to scale privileges on a machine to obtain <color=orange>administrator</color> privileges using a <color=#0FABFFFF>http</color> server vulnerability.",
    "SSHESCALE_USAGE": "<b>Usage: sshescale</b>\nMust be used in a machine with ssh server installed.",
    "WEB3XPLOIT_USAGE": "<b>Usage: web3xploit</b>\nMust be used in a machine with http server installed.",
    "WHOIS_DETAIL": "Provides public information about the IP address, such as domain name and information about the network administrator.",
    "MV_DETAIL": "Used to move files between folders.\n\nThe path can be absolute or relative.\nExample: <color=#0FABFFFF>mv Desktop/file.txt /home/Users/Player/DestFolder</color>\n\nIt can also be used to rename files.\nExample: <color=#0FABFFFF>mv Desktop/file.txt Desktop/othername.txt</color>",
    "CP_DETAIL": "Used to copy files between folders.\n\nThe path can be absolute or relative.\nExample: <color=#0FABFFFF>cp Desktop/file.txt /home/Users/Player/DestFolder</color>",
    "CHMOD_HELP": "The permissions of a file are classified in writing, reading and execution.\nThese permissions can be defined for the owner of the file, the group to which it belongs and others.\nThe -R parameter indicates recursion, that is, it is used to apply the permissions to a folder and all the files that are inside.\n\nExamples:\n\nTo add write permission for others:\n<color=#0FABFFFF>chmod o+w file.txt</color>\n\nTo remove the read permission to the group:\n<color=#0FABFFFF>chmod g-r file.txt</color>",
    "CHMOD_DETAIL": "Allows to modify the permissions of a file or folder.",
    "IWLIST_DETAIL": "Shows the list of wifi networks visible from your computer.",
    "CAT_DETAIL": "Shows the contents of a text file.",
    "RM_DETAIL": "Delete any file if you have the appropriate permissions.\nThis command permanently deletes the file without sending it to the trash.",
    "MKDIR_DETAIL": "Command used to create folders.",
    "IFCONFIG_DETAIL": "Displays the current information about the network devices installed on the machine.",
    "IWCONFIG_USAGE": "<b>Usage: iwconfig [net device] [bssid] [essid name] [pass key]</b>\nExample: iwconfig wlan0 00:11:22:33:44 mynetwork mypass",
    "IWCONFIG_DETAIL": "Used to connect to wifi networks.",
    "PS_USAGE": "<b>Usage: ps</b>",
    "PS_DETAIL": "Shows the active processes of the operating system.",
    "ADMINMONITOR_DETAIL": "It monitors all the networks to which the user is connected, notifies if any administrator is active in the network and notifies if the user is being tracked by the administrator.",
    "ADMINMONITOR_USAGE": "It can be launched from the terminal or the user interface by double clicking on the program.",
    "LOGVIEWER_USAGE": "It can be launched from the terminal or the user interface by double clicking on the program.",
    "LOGVIEWER_DETAIL": "It shows the log of the actions that have been carried out on the machine, such as network connections, deletion of files, etc.\n\nIf you have the necessary permissions the program allows you to delete records.",
    "MULTIPLAYER_MENU": "Online Mode",
    "LANGUAGE_MENU": "Language",
    "SINGLEPLAYER_MENU": "Single Player",
    "CREATESERVER_MENU": "CREATE DEDICATED SERVER",
    "GRAPHICS_MENU": "Graphics Settings",
    "CREDITS_MENU": "Credits",
    "EXIT_MENU": "Exit",
    "LISTSERVERS_MENU": "SERVER LIST",
    "BACK_MENU": "Back",
    "CANCEL_MENU": "CANCEL",
    "FULLSCREEN_MENU": "Full Screen",
    "RESOLUTION_MENU": "Screen Resolution",
    "FTP_USAGE": "<b>Usage: ftp [user@password] [ip address]</b>\nExample: ftp John@Connor 127.0.0.1",
    "FTP_DETAIL": "File Transfer Protocol (FTP) is the standard network protocol used for the transfer of computer files between a client and server on a computer network.",
    "FTP_HELP": "Since <color=#0FABFFFF>ftp</color> is used for file transfer, it's not possible to execute commands on the remote machine since <color=#0FABFFFF>ftp</color> does not offer a <color=orange>shell</color> unlike <color=#0FABFFFF>ssh</color>.\n\nOnce correctly connected to the remote machine, the user can use the terminal to move through the file system using common commands such as <color=#0FABFFFF>cd</color> or <color=#0FABFFFF>ls</color>, but only files that are between the connected machine and the <color=#0FABFFFF>ftp</color> server can be downloaded or uploaded.\n\nTo see a list of available commands while connected via <color=#0FABFFFF>ftp</color>, type <color=orange>help</color> in the terminal.\n\nTo be able to download <color=#0FABFFFF>ftp</color> files, use <color=#0FABFFFF><color=#0FABFFFF>get</color> file</color> command.\nTo upload files <color=#0FABFFFF><color=#0FABFFFF>put</color> file</color>.\n\nThe <color=#0FABFFFF>get</color> and <color=#0FABFFFF>put</color> commands can only be used when connected via <color=#0FABFFFF>ftp</color>.",
    "MAIL_USAGE": "It can be launched from the terminal or the user interface by double clicking on the program.",
    "MAIL_DETAIL": "It is the default client used to send and receive emails.\n\nIt can also be used as a <color=orange>social engineering</color> tool if it is used well.\n\nWhen you open the mail client, click on the option to write a new email, next to the subject click the <color=orange>[PF]</color> button. You will see a list of predefined emails that you can use to get useful information.\n\nThis list will grow as you increase your experience and reputation in the network.",
    "GET_USAGE": "<b>Usage: get [file]</b>\nExample: get document.txt",
    "PUT_USAGE": "<b>Usage: put [file]</b>\nExample: put document.txt",
    "HELP_FTP": "FTP available commands:\n\ncd\trm\nls\tclear\nexit\tmkdir\npwd\thelp\nput\tget\n",
    "INSTALLPACKAGE": "The following commands have been successfully installed:\n\n- airmon\n- aireplay\n- airodump\n- aircrack\n\nFor detailed <color=orange>help</color> open the <color=#0FABFFFF>manual</color> and click on the <color=#33cccc>external commands</color> category.",
    "MISSION_ALREADY_COMPLETED": "The mission does not exist.",
    "MONTH1": "January",
    "MONTH2": "February",
    "MONTH3": "March",
    "MONTH4": "April",
    "MONTH5": "May",
    "MONTH6": "June",
    "MONTH7": "July",
    "MONTH8": "August",
    "MONTH9": "September",
    "MONTH10": "October",
    "MONTH11": "November",
    "MONTH12": "December",
    "MISSION_WRONG_FILE": "You have not completed the mission. The file you have sent is not the one the client wants.\nYou can delete this message.",
    "TUTO_MAIL_OK_CONTENT": "I've been watching you for a while.\nI think we can do business together. Visit my website at <b> [IP_HACKSHOP] </b>",
    "WELCOME": "Welcome",
    "FIRST_STEPS": "If this is your first installation you will have verified that you do not have access to the <color=orange>network</color>, so you will not be able to do much until you get connected.\n\nIn the future you will be able to contract your own connection to the <color=orange>network</color> for a monthly amount, but for the moment you will have to access it in another way.\n\nThe operating system has a security suit installed by default that can help you connect to the <color=orange>network</color>.\n\nFor more information it is recommended that you read the following entries in the manual under the Network <color=orange>commands</color> category in the following order:\n\n<color=#0FABFFFF>1. airmon</color>\n<color=#0FABFFFF>2. iwlist</color>\n<color=#0FABFFFF>3. aireplay</color>\n<color=#0FABFFFF>4. aircrack</color>\n\nTo launch <color=orange>commands</color> you need to use the <color=#0FABFFFF>terminal</color>. You will find a shortcut on the desktop.\n\nOnce you have access to the <color=orange>network</color> we recommend that you create an <color=#33cccc>email account</color>. Use the <color=orange>browser</color> to find a mail services.",
    "IWLIST_HELP": "<mark=#00D0124D><b>[Usage Details]</b></mark>\n\nOnce the iwlist command is executed the output will show something similar to this:\n<color=orange>BSSID</color>              <color=orange>PWR</color>   <color=orange>ESSID</color>\n<color=orange>14:C7:E5:46:D9:F5  65%   corpdevice</color>\n\n<color=orange>BSSID</color> is the identifier of the device.\n<color=orange>PWR</color> is the coverage that reaches the Wi-Fi network installed in your PC in a range of 0% to 100%. The higher this number is, the closer your device is to your location and you can capture the packets faster.\n<color=orange>ESSID</color> is the name of the router access point.",
    "SUDO_USAGE": "<b>Usage: sudo [opt:-s] [command] </b>\n<b>Usage: sudo -u [username] </b>\nExample: sudo rm file.txt",
    "SUDO_DETAIL": "It allows users to run programs with administrator security privileges, also known as <color=orange>root</color>.\nIt can also be used to access as any other user registered on the machine, using the -u parameter.",
    "SUDO_HELP": "The <color=#0FABFFFF>sudo</color> command can be executed to obtain <color=orange>root</color> permissions only for the execution of that command.\nExample: <color=#0FABFFFF>sudo</color> rm file.txt\n\nOr to login as <color=orange>root</color> user.\nExample: <color=#0FABFFFF><color=#0FABFFFF>sudo</color> -s</color>\n\nIn both cases, the administrator password will be requested before continuing.\n\nThe <color=#0FABFFFF>sudo</color> command also allows access like any other user registered on the machine:\nExample: <color=#0FABFFFF><color=#0FABFFFF>sudo</color> -u</color> john\n\nThe user password will be requested before continuing.",
    "MISSION_ERROR": "Sorry, it seems that there has been some problem and the mission is no longer available.\nYou can delete this message.",
    "USERADD_USAGE": "<b>Usage: useradd [new username]</b>\nExample: useradd john",
    "USERDEL_USAGE": "<b>Usage: userdel [opt:-r] [username]</b>\nUse paremeter <b>-r</b> to delete user files too.\nExample: userdel -r john",
    "USERADD_DETAIL": "Command used to change the password of a user account on the machine.",
    "USERDEL_DETAIL": "Utility that is used for deleting user accounts.",
    "USERDEL_HELP": "If the <color=orange>-r</color> parameter is used in addition to deleting the user from the system, it will also delete the folders and files created under its user folder located in <color=yellow>/home/username</color>.",
    "SAVEGAME": "The game is automatically saved in real time in both multiplayer and single player mode, so you do not have to worry about saving the game.\n\nTo exit the game open the main menu, located in the upper left corner of the screen, and select the option <color=#0FABFFFF>shutdown</color>. When you start the game you will find everything as you left it.",
    "DECIPHER_DETAIL": "Decrypts certain system files and converts it to plain text.",
    "MISSION_LAN_IP": "It's important that you access the correct machine behind the public ip. The victim's ip LAN is",
    "TUTORIAL_START": "Welcome to your new Operating System.\n\nThe <color=#33cccc>tutorial</color> will teach you the basics to know how to move around the OS.",
    "TUTORIAL_PAGE_WINDOWS": "The window system is similar to any other operating system.\n\nYou can move, minimize, maximize and resize windows using the UI.\n\nYou can also create files, delete them, move them and execute programs with the user interface as in any Operating System.\n\n[ACTION] To continue, close this window and then double click on the <color=#0FABFFFF>FileExplorer</color> program on the <color=orange>desktop</color>. [/ACTION]",
    "TUTORIAL_PAGE_FILESYSTEM": "It is important that you know how the <color=orange>file system</color> is structured.\n\nIt is quite simple: All folders hang from a main folder represented with the <color=yellow>/</color> character and is the first or the highest directory in the hierarchy.\n\nIt can be likened to the <color=#33cccc>trunk of a tree</color>, as the starting point where all <color=#33cccc>branches</color> originate from.",
    "TUTORIAL_PAGE_FILESYSTEM2": "When you open the <color=#0FABFFFF>FileExplorer</color> program by default it opens in the home folder of the user who launched it.\n\nIn your case, your user's path is: <color=yellow>[HOME_PATH]</color>\n\nThis is the path where your user's configuration files will be saved and where you will normally work.\n\nWhen a user is created on the machine, their user files will be created automatically under the <color=yellow>/home</color> path.",
    "TUTORIAL_PAGE_TERMINAL": "It's time to go to the <color=#0FABFFFF>Terminal</color>.\n\nAt certain moments of the game it will be necessary to execute commands from the terminal to access remote machines or launch tools that do not have a visual variant.\n\nIt is easier than it seems to be. \n\n[ACTION]Open the <color=#0FABFFFF>Terminal</color> program that is on the <color=orange>desktop</color> and press <color=orange>Next</color>.[/ACTION]",
    "TUTORIAL_PAGE_TERMINAL2": "Think of the <color=orange>terminal</color> as a kind of <color=orange>File Explorer</color>.\n\nFrom the <color=orange>terminal</color> you browse the folders and run programs the same way you do with the browser.\n\nBy default, when you open the <color=orange>terminal</color>, you are in the path of your user. \n\n[ACTION]Type <color=#0FABFFFF>pwd</color> in the <color=orange>terminal</color> and press <color=#33cccc>Enter</color> to launch the command. The command will show you the path you are currently on.[/ACTION]",
    "TUTORIAL_PAGE_TERMINAL3": "[ACTION]To list the files that are in the folder where you are, use the <color=#0FABFFFF>ls</color> command.[/ACTION]",
    "TUTORIAL_PAGE_TERMINAL4": "Now you will learn how to create folders from the <color=orange>terminal</color>.\n\nYou can also create folders from the file explorer, but it is important that you learn to do it from the <color=orange>terminal</color> to understand how it works.",
    "TUTORIAL_PAGE_TERMINAL5": "From the <color=orange>terminal</color>, create a folder called <color=#33cccc>test</color> in your <color=yellow>[HOME_PATH]/Desktop</color> folder.\n\nFirst enter the Desktop folder executing the following command:\n[ACTION]<color=#0FABFFFF>cd Desktop</color>[/ACTION]",
    "TUTORIAL_PAGE_TERMINAL6": "Note that in the <color=orange>terminal</color> you can write the complete path of any file. \n\nFor example, you can enter the Desktop folder from anywhere in the <color=orange>terminal</color> by typing the full path:\n\n<color=#0FABFFFF>cd [HOME_PATH]/Desktop</color>\n\nThe <color=orange>terminal</color> also accepts relative path.\n\nThis applies to any command you use.",
    "TUTORIAL_PAGE_TERMINAL7": "Execute the <color=#0FABFFFF>ls</color> command to see the files that are in the folder.\n\nAs you can see, they are the same files that you see on your desktop.",
    "TUTORIAL_PAGE_TERMINAL8": "[ACTION]Now type <color=#0FABFFFF>mkdir test</color> to create the folder.[/ACTION]\n\nYou can see the folder created from the <color=orange>file explorer</color> or the <color=orange>desktop</color> itself.",
    "TUTORIAL_PAGE_TERMINAL9": "You already know what is necessary to use the <color=#0FABFFFF>terminal</color>, you still have a couple of important things to know, but I'll tell you later.",
    "TUTORIAL_PAGE_WIFI": "As you know a computer without <color=orange>internet</color> access does not have much utility, and at the moment you do not have access to the <color=orange>network</color>.\n\nYour computer is equipped with a wireless <color=orange>network</color> card, if you click on the <color=orange>wifi</color> icon in the top bar, you can see the <color=orange>network</color>s you have at your range.",
    "TUTORIAL_PAGE_WIFI2": "Now you are going to use the equivalent command in the <color=#0FABFFFF>terminal</color>, which will give you some extra information of these networks that you will find useful to crack a password.\n\nOpen the <color=#0FABFFFF>terminal</color> and type <color=#0FABFFFF>iwlist eth0</color>\n\nThe parameter eth0 refers to your network card. If you had more than one network card they would be named eth1, eth2, etc.",
    "TUTORIAL_PAGE_WIFI3": "As you can see after launching the command it shows you the same list of networks as using the user interface, but with some extra information.",
    "TUTORIAL_PAGE_END1": "It's time to get access to the <color=#33cccc>network</color>.\n\nThis part of the tutorial will not be guided, you will have to be able to read the instructions of a series of commands and execute them correctly.\n\nThe <color=#0FABFFFF><color=orange>Manual</color></color> is an essential tool to know in detail how programs found on your computer works. \n\nIn the <color=#0FABFFFF><color=orange>Manual</color></color> you will find examples of the use of commands and programs. It is always a good idea to check it when you have downloaded a new program.\n\n[ACTION]To access the <color=#33cccc>network</color>, open the <color=#0FABFFFF><color=orange>Manual</color></color> and click on the <mark=#00D0124D><b>[First Steps]</b></mark> section to get more information.[/ACTION]",
    "RENT_SERVER": "Thank you for your purchase, your server is ready!\n\nHere you have the credentials to access via <color=#0FABFFFF>ssh</color>:\n\nIP: [PUBLIC_IP]\nuser: root\npassword: [ROOT_PASSWORD]\n\n[ADD_SERVER_MAP]",
    "MISSION_SERVICE_PC_NOT_EXIST": "The IP address you have provided does not belong to any computer.\nMake sure the address is correct and belongs to an accessible computer.\n\nYou can delete this message.",
    "MISSION_SERVICE_WRONG_IP": "The format of the IP address that you have provided is incorrect.\nPlease try again and make sure you enter the address correctly.\n\nYou can delete this message.",
    "MISSION_SERVICE_START": "The data you have provided is correct. \nThe mission is now active. \n\nMake sure you do not interrupt access to the machine until the end date.",
    "MISSION_SERVICE_FAILED_INI": "You have taken too long to configure the server and the client has canceled the job.",
    "MISSION_ALREADY_STARTED": "The mission was already active. Remember not to interrupt access to the server.",
    "NSLOOKUP_USAGE": "<b>Usage: nslookup [web address]</b>\nExample: nslookup www.website.com",
    "NSLOOKUP_DETAIL": "It is used to obtain the ip address knowing the name of the web.",
    "SSHD_USAGE": "<b>Usage: sshd [start|stop]</b>\nExample: sshd start",
    "FTPD_USAGE": "<b>Usage: ftpd [start|stop]</b>\nExample: ftpd start",
    "HTTPD_USAGE": "<b>Usage: httpd [start|stop]</b>\nExample: httpd start",
    "ERROR_NO_HOME": "Error: Can't find your user desktop path: <b>/home/[activeUser]/Desktop</b>\n\nThis error usually occurs because the user has accidentally changed the name of their user folder under the path /home.\n\nYour home path <b>/home/[activeUser]/Desktop</b> has been recreated.",
    "CRIME_ROBBERY": "Robbery",
    "CRIME_MURDER": "Murder",
    "CRIME_FRAUD": "Fraud",
    "CRIME_EXHIBITIONISM": "Exhibitionism",
    "CRIME_DRUGS": "Drug trafficking",
    "CRIME_AGGRESSION": "Aggression",
    "CRIME_KIDNAPPING": "Kidnapping",
    "CRIME_HACKING": "Hacking",
    "CRIME_TAX": "Tax evasion",
    "MISSION_POLICE_TITLE": "Police record",
    "MISSION_POLICE_CONTENT": "The client wants to modify the information of a police record.",
    "MISSION_POLICE_CHANGES": "It is necessary that you infiltrate the network to modify the date of certain charges.",
    "MISSION_POLICE_REMOVE": "It is necessary that you infiltrate in the network to eliminate the complete record of a person.",
    "MISSION_POLICE_ADD_CHARGE": "You need to infiltrate the network to add a charge to a person's record.",
    "MISSION_POLICE_REMOVE_CHARGE": "You need to infiltrate the network to remove a charge to a person's record.",
    "MISSION_POLICE_MODREG": "The client wants to modify the charge of [CRIME] so that the date of the crime is [YEARS] years before it was committed.",
    "MISSION_POLICE_DETAIL_REMOVE_CHARGE": "The client wants to delete the charge of [CRIME]. To avoid raising suspicion, you only have to eliminate the indicated crime, do not eliminate any other.",
    "MISSION_POLICE_DETAIL_ADD_CHARGE": "The client wants to add the charge of [CRIME] in the year [YEAR]. To avoid raising suspicion, you only have to add the indicated crime.",
    "MISSION_POLICE_DETAIL_DELETE": "The client wants to delete the record completely.",
    "MISSION_FAILED": "You have not completed the order requirements. The job is cancelled.",
    "MISSION_DESTROY_PC_TITLE": "Corrupt data",
    "MISSION_DESTROY_PC_CONTENT": "The client wants the remote machine to stop working.",
    "MISSION_DESTROY_PC": "Be careful since the administrator will want to know who was responsible.",
    "PASSWD_USAGE": "<b>Usage: passwd [username]</b>\nExample: passwd john",
    "PASSWD_DETAIL": "",
    "PASSWD_HELP": "To change a password of a user, first \"<color=#0FABFFFF>sudo</color>\" to the \"<color=orange>root</color>\" account. Then type, <b>passwd user</b> (where user is the username for the password you are changing)",
    "HINT_COMM_NOTFOUND": "You may want to launch the command found in:\n[PATH_COMMAND]\n\nTo execute it you have to <b>cd</b> in the folder where the command is located.\n\nIf you want to launch the command from anywhere in the terminal, copy it to the global path in: <b>/bin</b> or <b>/usr/bin</b>",
    "WARNING_PASSWORD": "It is not recommended to use any of your real-life passwords in the game, since these passwords can be discovered by other players and are accessible by any administrator of the game server.\n\nIt is also not recommended to use any real password in single player mode since the passwords are saved in plain text in the game's installation folder.",
    "TUTORIAL_PAGE_FILESYSTEM3": "[ACTION]Now go to the main folder, the top folder in the file hierarchy and click <color=orange>Next</color>.[/ACTION]",
    "TUTORIAL_PAGE_FILESYSTEM4": "Here you can see all the folders that hang from the main one. \n\nAt the moment we are only interested in the <color=yellow>/bin</color> folder and the <color=yellow>/usr<color=yellow>/bin</color></color> folder.\n\n[ACTION]Go to the <color=yellow>/bin</color> folder and press <color=orange>Next</color>.[/ACTION]",
    "TUTORIAL_PAGE_FILESYSTEM5": "By default, the commands used by the terminal are saved in the folder <color=yellow>/bin</color>. We will come back here later.\n\n[ACTION]Now go to the path <color=yellow>/usr<color=yellow>/bin</color></color> and press <color=orange>Next</color>.[/ACTION]",
    "TUTORIAL_PAGE_FILESYSTEM6": "And here <color=orange>programs</color> that have <color=#33cccc>UI</color> (user interface) are saved by default.\n\nYou can run any program by double clicking as in any operating system.",
    "TUTORIAL_PAGE_FILESYSTEM7": "Remember that in the <color=#0FABFFFF>FileExplorer.exe</color> program and on the <color=#0FABFFFF>desktop</color> you can copy files by dragging their icon to the place you want, renaming or deleting files, creating folders, etc.\n\nYou can open the <color=orange>contextual menu</color> on a file or folder to see the available actions by clicking the <color=#33cccc>right mouse button</color> on the file.",
    "TUTORIAL_PAGE_TERMINAL10": "If you want you can delete the folder from <color=orange>UI</color> by clicking on the icon with the <color=#33cccc>right mouse button</color> and then select delete.\n\nYou can also delete it from the te<color=#0FABFFFF>rm</color>inal by typing the command: <color=#0FABFFFF><color=#0FABFFFF>rm</color> -r test</color>\n\nNote that the files that you delete from the <color=orange>UI</color> will be moved to the recycle bin, but if you delete files from the te<color=#0FABFFFF>rm</color>inal with the <color=#0FABFFFF>rm</color> command they will be deleted directly without going to the trash.",
    "TUTORIAL_RESET": "This option enables the tutorial of the start of the game. It also affects the help windows that appear when you open certain programs for the first time.\n\nThe reset button restarts the tutorial and the help windows in the programs are displayed again.",
    "TUTORIAL_GIFT": "After having connected for the first time to a Wi-Fi network, the next time you start a new game you will have a file on the desktop called Gift.txt which will give you the password of one of the Wi-Fi networks you have available.\n\nIf you deactivate this option you will have to crack a wifi password every time you start a new game or after a Game Over.",
    "TUTORIAL_RESET_MISSION": "This option resets the first available mission after accessing the network for the first time.",
    "CLOSE_PROGRAM_TUTORIAL": "You have a tutorial associated with this window. \n\nIf you close this window the current tutorial will be canceled, but it will start again the next time you open this program.\n\nDo you want to continue?",
    "CLOSE_TUTORIAL_WINDOW": "Do you want to skip the current tutorial?",
    "TUTORIAL_MAIL": "Great! You already have an internet connection and you have received your first email.\n\nBut first you need to know a couple of things about the mail program.",
    "TUTORIAL_MAIL2": "As in any mail program you can write emails in addition to receiving them. But here you also have some predefined emails that can be very useful.\n\nClick on the email button and click <color=orange>Next</color>.",
    "TUTORIAL_MAIL3": "The mail client can be used as a <color=orange>social engineering</color> tool if it is used well.\n\nIf you click on the <color=#33cccc>[PF]</color> button next to the subject, you will get a list of predefined emails that you can use to get useful information.\n\nThis list will grow as you increase your experience and reputation in the network.\n\nThis is all for now. You can close this window.",
    "TUTORIAL_REMOTE_CONN": "Your first remote connection!\n\nBefore continuing, it is important that you know some details about remote connections.",
    "TUTORIAL_REMOTE_CONN2": "Remote connections can only be made through the terminal.\n\nIn addition to the <color=#0FABFFFF>ssh</color> command, you will discover other programs that will also allow you to connect remotely to a machine",
    "TUTORIAL_REMOTE_CONN3": "When connected to a machine you can navigate through its file system and run programs as if it were your machine, provided you have the necessary permissions.\n\nNote that you can launch visual programs through the <color=orange>terminal</color> even connected to a remote machine.",
    "TUTORIAL_REMOTE_CONN4": "For example, although you can use the scp command to upload and download files from the remote machine, you can also do so using the UI.\n\n[ACTION]To do this, launch the <color=#0FABFFFF>FileExplorer.exe</color> program from the terminal where you are connected to the remote machine and press <color=orange>Next</color>.[/ACTION]",
    "TUTORIAL_REMOTE_CONN5": "As you can see, you are browsing through the file system of the remote machine using FileExplorer.\n\nYou can copy and paste files between machines using FileExplorer, either by dragging the icons or by using the context menu.\n\nLike FileExplorer.exe, you can launch any program and command that is on the remote machine.",
    "TUTORIAL_REMOTE_CONN6": "It's a good time to show you how to avoid being caught by the authorities.",
    "TUTORIAL_PAGE_TERMINAL11": "Ok, we are on the path <color=yellow><color=yellow>[HOME_PATH]</color>/Desktop</color>.\n\nLet's go back to the path <color=yellow>[HOME_PATH]</color>.\n\nTo go to the upper folder type the command\n[ACTION] cd .. [/ACTION]",
    "TUTORIAL_PAGE_TERMINAL12": "You can also return to your <color=yellow>[HOME_PATH]</color> folder from anywhere in the <color=orange>terminal</color> by typing only the <color=#0FABFFFF>cd</color> command without any parameters.",
    "TUTORIAL_PAGE_TERMINAL13": "And last but not least.\n\nDo you remember the <color=yellow>/bin</color> and <color=yellow>/usr<color=yellow>/bin</color></color> paths?\n\nIt is where the commands and programs are stored by default respectively.\n\nYou can launch any program that is in these folders from any path where you are in the terminal.\n\nBut any command or program that is not in any of these two paths, you will have to locate yourself in that folder to be able to launch it or write the complete or relative route to the program.",
    "TUTORIAL_REMOTE_CONN7": "When you access a remote computer without authorization it is very likely that you will attract the attention of the system administrator.\n\nIf it finds the machine that started the hacking, it will inform the authorities.\nDepending on the type of network you have accessed, administrators can be more or less permissive. \n\nA good administrator usually finds suspicious activity where others do not see it or simply ignore it.\n\nIn any case, it is highly recommended that you delete your tracks once you have finished an intrusion. \nAll computers keep a log of the log in <color=yellow>/var/system.log</color>.\n\nIn it, system events are registered, such as incoming or outgoing connections, deletion of files, etc.",
    "TUTORIAL_REMOTE_CONN8": "To open the <color=orange>system.log</color> file you need to use a visual program <color=#0FABFFFF>LogViewer.exe</color>\n\nTo do this, open the <color=orange>system.log</color> file on the remote machine using the FileExplorer program you have connected.\n\n[ACTION]With the FileExplorer connected to the remote machine, go to the <color=yellow>/var</color> folder and double click on the <color=orange>system.log</color> file and click <color=orange>Next</color>.[/ACTION]",
    "TUTORIAL_REMOTE_CONN9": "It is important to keep in mind that the deletion of the records is only useful when a passive trace occurs.\n\nThere are two types of traces an administrator can perform: <mark=#00D0124D><b>[Active Trace]</b></mark> and <mark=#00D0124D><b>[Passive Trace]</b></mark>.\n\nSystem administrators, like any other worker, have a work schedule.\nIt is usually advisable to access remote machines at times when the administrator is not working.\n\nPrograms like <color=orange>AdminMonitor</color> notify you in an automated way when an administrator is present and the approximate time remaining until an active trace reaches you.\n\nIt is highly recommended that you take a look at the <color=orange>Manual</color>. In the <color=orange>Trace System</color> section to know in more depth how the traces work and the different ways to avoid them.\n\nFor the moment it is enough that you know this way to eliminate your trace.",
    "TUTORIAL_REMOTE_CONN10": "If the AdminMonitor program warns you that a admin has started an active trace against you it is important that you try to delete the indicated entries and disconnect before the end of the countdown. \n\n<color=orange>Do not delete the entire log</color>, since inevitably when you disconnect from the machine you will create an entry in the log with your disconnection, creating the file if you had deleted it.\n\nIf an administrator sees a log file with only a disconnect entry, he will suspect and start the trace against you.\n\nThis is all for the moment, you can close this window.",
    "TUTORIAL_REMOTE_CONN11": "It is important that you remove any traces that may incriminate you in an unauthorized connection. \n\nIn the current version of the game you just have to delete any entry in the file <color=yellow>/var/system.log</color> that is either \n<mark=#00D0124D><b>[shell obtained]</b></mark> or <mark=#00D0124D><b>[file deleted]</b></mark> along with your IP address.",
    "TUTORIAL_QUESTION_RESET": "All programs tips and the initial tutorial will be restarted.\n\nDo you want to continue?",
    "TUTORIAL_WELCOME_ACTION": "To continue, close this window and then double click on the FileExplorer program on the desktop.",
    "TUTORIAL_DISABLED": "The tutorial has been disabled.\n\nYou can re-enable it from <color=#33cccc>Menu > Preferences > Tutorial</color>\n\nIt is recommended to read the <color=orange>Manual</color> to know how programs and commands work. You can open the <color=orange>Manual</color> from the desktop by double clicking the mouse on its icon.\n\nYou can also access the help in <color=#33cccc>Menu > Help</color>",
    "TUTORIAL_CONTINUE_CLOSE": "To continue, close this window.",
    "TUTORIAL_TERMINAL_QUESTION": "A question before starting.\n\nDo you have experience using the UNIX command terminal?",
    "TUTORIAL_PAGE_END2": "You can close this window.\nGood luck!",
    "LS_USAGE": "<b>Usage: ls [opt:-l, -a, -la] [opt: path]</b>\nIt can be called without parameters.",
    "LS_DETAIL": "Shows the list of files in the current folder",
    "LS_HELP": "Alternatively you can use the <color=#0FABFFFF>-l</color> parameters to list the files in detailed mode and <color=#0FABFFFF>-a</color> to show the hidden files.\n\nYou can combine the parameters.\n\nExample 1: <color=#0FABFFFF>ls <color=#0FABFFFF>-l</color></color>\nExample 2: <color=#0FABFFFF><color=#0FABFFFF>ls <color=#0FABFFFF>-l</color></color>a</color>",
    "HARDWARE_INSTALLED": "The hardware will be installed in the next 12 hours.\nYou will be notified when the job is completed.",
    "INVALID_PASS": "<b>There has been a problem synchronizing your user with server.</b>\n\nIf you are accessing from a different computer than you usually use, you must copy the <b>PlayerData</b> file from your other computer to this one. \n\nYou will find the <b>PlayerData</b> file where you installed the game.\n\nIf the problem persists, please contact the developer through the Steam or Discord forums.",
    "INSTALL_HARDWARE": "The hardware you have purchased is ready to be installed.\n\nClick on the install button to open the hardware installation window.",
    "HDD_PERFORMANCE": "The hard disk has performance issues, the copy speed may be affected.",
    "PSU_LOWPOWER": "The power supply can not provide enough power. This can lead to an unstable system.",
    "CPU_DAMAGED": "The processor is damaged. This can lead to an unstable system.",
    "INSTALLED_HARDWARE": "The configuration is correct! \n\nIt is necessary to restart the machine so that our systems install the new hardware.",
    "NO_BUY_MORE_HARDWARE": "At this time you can not buy more hardware until you receive the order you have on the way.",
    "IO_ERROR": "I/O error. The process could not be completed. System unstable.",
    "NO_RAM_MSG": "I can not open the program. There is not enough RAM available. Close some program and try again.",
    "RAM_DAMAGED": "The memory RAM is damaged. This can lead to an unstable system.",
    "MOTHERBOARD_DAMAGED": "The motherboard is damaged. This can lead to an unstable system.",
    "TUTORIAL_FTP": "Your first FTP remote connection!\n\nBefore continuing, it is important that you know some details about ftp connections.",
    "TUTORIAL_FTP2": "Remote <color=#0FABFFFF>ftp</color> connections can only be made through the terminal.\n\nYou can use other programs to remotely connect as <color=#0FABFFFF>ssh</color>, which allows you to run programs and commands on the remote machine.",
    "TUTORIAL_FTP3": "In contrast <color=#0FABFFFF>ftp</color> (File Transfer Protocol) can only be used for file transfer, so you can not execute commands on the remote machine. \n\nOnly the commands available in <color=#0FABFFFF>ftp</color>.\n\nTo see a list of available commands while connected via <color=#0FABFFFF>ftp</color>, type help in the terminal.\n\nYou can find more detailed information about <color=#0FABFFFF>ftp</color> in the manual.",
    "NO_RAM_REMOTE": "I can not open the program. There is not enough RAM available on your host machine to load the UI. Close some program and try again.",
    "SSH-SERVER_DETAIL": "Install an SSH access server on the machine.",
    "FTP-SERVER_DETAIL": "Install an FTP access server on the machine.",
    "HTTP-SERVER_DETAIL": "Install an HTTP server on the machine to host web pages.",
    "PLAY_GAME": "Play Game",
    "ONLINE_MODE_DESC": "Explore the Grey Hack universe and forge your own reputation in a world shared by all players. When you leave the game, the online universe remains actively running 24/7.",
    "SINGLEPLAYER_MODE_DESC": "You play in a world created on your computer. Unlike Online Mode, when you exit the game in Single Player, the in-game universe stops, and progress resumes only upon your return.",
    "LANGUAGE_AVAILABLE": "Available languages",
    "YES": "Yes",
    "EXIT_CONFIRMATION": "Are you sure you want to exit?",
    "OPTION_UNAVAILABLE": "This option is not available in the current version of the game.",
    "ENGLISH": "English",
    "SPANISH": "Spanish",
    "DELETE_PROGRESS_TITLE": "Delete Current Progress",
    "DELETE_PROGRESS": "If you want to delete your current game and start a new one, select one of the following options. This will eliminate your current progress.",
    "MISSION_LAN_IP_STUDENTS": "The LAN address where the database is located is <b>[IP_SERVER_STUDENTS]</b>. If you can not access directly, you can try to access through a teacher's computer in the local network.",
    "BUILD_USAGE": "<b>Usage: build [file_source_code] [path_new_program]</b>\nThe paths can be relatives.\n\nExample: build helloworld.txt /home/user/Desktop",
    "DOC_GENERAL_TYPEOF": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] any object\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a string with the type of the object passed as a parameter.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nmyvalue = \"hello\"\ntypeObj = typeof(myvalue)\nprint(\"Type is: \" + typeObj)</font>\n\n<color=orange>#Output</color>: Type is: string",
    "DOC_GENERAL_GET_ROUTER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1][opt] <color=#33cccc>string</color> ip_address\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the router whose public IP matches, otherwise returns null.\nIf the ip_address parameter is not specified, returns the router to which the computer executing this command is connected.",
    "DOC_GENERAL_NSLOOKUP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1]<color=#33cccc>string</color> web_address\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the IP address that is behind the web address that has been provided.",
    "DOC_COMPUTER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns an object of type <color=#33cccc>Computer</color> that is the computer that is executing the script.",
    "DOC_GENERAL_WHOIS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ip_address\n\n<mark=#00D0124D><b>[Description]</b></mark>\nShows the administrator information behind the IP provided.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\ninfo = whois(\"125.58.74.52\")\nprint(info)</font>",
    "DOC_GENERAL_COMMAND_INFO": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> key_command\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the information of common commands of the Operating System, such as mkdir, whois, etc.\n\n<mark=#00D0124D><b>[Example]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">info = command_info(\"cp_usage\")\nprint(info)</font>\n\n<color=orange>#Output</color>: <b>Usage: cp [path to file] [path to copy]</b>",
    "DOC_SHELL_BUILD": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> path_source_code\n[2] <color=#33cccc>string</color> path_destination_folder\n[3] [opt] bool allow_import\n\n<mark=#00D0124D><b>[Description]</b></mark>\nCompile the source code of the file that is in the provided path, and save the executable in the destination path.\nThe name of the executable is the same as that of the source file without the extension.\n\nThe provided paths must be absolutes.\n\n<mark=#00D0124D><b>[Example]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">get_shell.build(\"/home/user/myprogram.src\", \"/home/user/Desktop\")</font>",
    "DOC_SHELL_LAUNCH": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> program_path\n[2] <color=#33cccc>string</color> program parameters\n\n<mark=#00D0124D><b>[Description]</b></mark>\nLaunches the command in the provided path.\n\n<mark=#00D0124D><b>[Example]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">get_shell.launch(\"/bin/cat\", \"/etc/passwd\")</font>",
    "DOC_GENERAL_FORMAT_COLUMNS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> text\n\n<mark=#00D0124D><b>[Description]</b></mark>\nFormat the text provided so that it is ordered by columns.",
    "DOC_GENERAL_CURRENT_DATE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the time and date.",
    "DOC_GENERAL_IS_LAN_IP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ip_address\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns <color=#33cccc>true</color> if the provided address is local, <color=#33cccc>false</color> otherwise. If the provided IP is not valid, it also returns <color=#33cccc>false</color>.",
    "DOC_GENERAL_PARENT_PATH": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> path\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the path provided without the last element. It does not take into account if the path exists.\n\n<mark=#00D0124D><b>[Example]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">newPath = parent_path (\"/home/user/Desktop\")\nprint (\"new path:\" + newPath)</font>\n\n<color=orange>#Output</color>: new path: /home/user",
    "DOC_GENERAL_IS_VALID_IP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ip_address\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns <color=#33cccc>true</color> if the provided address is valid, <color=#33cccc>false</color> otherwise.",
    "DOC_COMPUTER_PUBLIC_IP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the public ip of the router or computer object.\n\n<mark=#00D0124D><b>[Example]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">print(\"Public ip:\" + get_router.public_ip)</font>\n<font=\"SourceCodePro-Regular SDF\">print(\"Public ip:\" + host_computer.public_ip)</font>",
    "DOC_GET_COMPUTER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> lan_ip\n\n<mark=#00D0124D><b>[Description]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">Returns the computer of the local network whose IP matches the one provided.</font>",
    "DOC_GET_COMPUTERS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns an array of all the computers that are active and connected to the router in the local network.",
    "DOC_ROUTER_PING_PORT": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>int</color> port_number\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the port object that is behind the port number provided if exists, null otherwise.",
    "DOC_ROUTER_PORT_INFO": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] port portObj\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a string with the information of the port that has been provided. The port provided must not belong to another network than this router.\n\n<mark=#00D0124D><b>[Example]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">router = get_router\nports = router.used_ports\nfor port in ports\n    print(\"info: \" + router.port_info(port))\nend for</font>",
    "DOC_ROUTER_USED_PORTS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns an array of ports that are being used in this router.\n\n<mark=#00D0124D><b>[Example]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">router = get_router\nports = router.used_ports\nfor port in ports\n    print(\"info: \" + router.port_info(port))\nend for</font>",
    "DOC_COMPUTER_GET_PORTS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns an array of active ports on the computer.\n\n<mark=#00D0124D><b>[Example]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">router = get_router\nports = get_shell.host_computer.get_ports\nfor port in ports\n    print(\"Info: \" + router.port_info(port))\nend for</font>",
    "DOC_COMPUTER_IS_NETWORK_ACTIVE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns <color=#33cccc>true</color> if the computer has internet access, <color=#33cccc>false</color> otherwise.",
    "DOC_COMPUTER_LOCAL_IP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the computer or router local ip address.\n\n<mark=#00D0124D><b>[Example]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">print( host_computer.local_ip )</font>\n<font=\"SourceCodePro-Regular SDF\">print( get_router.local_ip )</font>",
    "DOC_COMPUTER_FILE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> path_file\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the file located in the given path, relative or absolute. The file returned can be a folder. If the file does not exist, it is returned null.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nfile = get_shell.host_computer.File(\"/etc/passwd\")\nif file != null then\n   print(file.content)\nend if</font>",
    "DOC_GENERAL_CURRENT_PATH": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nIt returns a <color=#33cccc>string</color> with the path in which the terminal is at the moment of launching the script.",
    "DOC_COMPUTER_CREATE_FOLDER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> path\n[2] <color=#33cccc>string</color> folder_name\n\n<mark=#00D0124D><b>[Description]</b></mark>\nCreate a folder in the specified path.\n\n<mark=#00D0124D><b>[Example]</b></mark>\n<font=\"SourceCodePro-Regular SDF\">get_shell.host_computer.create_folder(\"/home/user/Desktop\", \"myfolder\")</font>",
    "DOC_FILE_COPY": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> path\n[2] <color=#33cccc>string</color> file_new_name\n\n<mark=#00D0124D><b>[Description]</b></mark>\nCopy the file to the specified path.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\norigFile = get_shell.host_computer.File(\"/home/user/myfile.txt\")\norigFile.copy(\"/home/user/Desktop\", \"copyfile.txt\")</font>",
    "DOC_FILE_MOVE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> path\n[2] <color=#33cccc>string</color> file_new_name\n\n<mark=#00D0124D><b>[Description]</b></mark>\nMove the file to the specified path.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\norigFile = get_shell.host_computer.File(\"/home/user/myfile.txt\")\norigFile.move(\"/home/user/Desktop\", \"movefile.txt\")</font>",
    "DOC_FILE_RENAME": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> new_name\n\n<mark=#00D0124D><b>[Description]</b></mark>\nRename the file with the name provided.",
    "DOC_FILE_PATH": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the path of the file.",
    "DOC_FILE_GET_CONTENT": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the contents of the text file.",
    "DOC_FILE_IS_BINARY": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns <color=#33cccc>true</color> if the file is binary, <color=#33cccc>false</color> otherwise.",
    "DOC_FILE_HAS_PERMISSION": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> type_perm\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns true if the user who launches the script has the necessary permissions.\nThe type_perm parameter is used for reading (\"r\"), writing (\"w\") and execution (\"x\")\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nfile = get_shell.host_computer.File(\"/home/user/test.txt\")\nif file.has_permission(\"r\") then\n   print(file.content)\nelse \n   print(\"permission denied\")\nend if</font>",
    "DOC_FILE_PARENT": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the folder that contains this file.",
    "DOC_FILE_NAME": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the name of the file.",
    "DOC_IS_FOLDER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns <color=#33cccc>true</color> if the file is a folder, <color=#33cccc>false</color> otherwise.",
    "DOC_FILE_DELETE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nDelete the file.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nfile = get_shell.host_computer.File(\"/home/user/myfile.txt\")\nif file.has_permission(\"w\") then\n   file.delete\nelse\n   print(\"permission denied\")\nend if</font>",
    "DOC_FILE_GET_FOLDERS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns an array of the folders contained in this object. This function is only available if this object is a folder, so it is advisable to first use the <color=orange>is_folder</color> function before calling this method.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nparent = get_shell.host_computer.File(\"/home/user\")\nif parent.<color=orange>is_folder</color> then\n   folders = parent.get_folders\n   for folder in folders\n       print(\"Folder name: \" + folder.name)\n   end for\nend if</font>",
    "DOC_FILE_GET_FILES": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns an array of files (excluded folders) contained in this object. This function is only available if this object is a folder, so it is advisable to first use the is_folder function before calling this method.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nparent = get_shell.host_computer.File(\"/home/user/Desktop\")\nif parent.is_folder then\n   files = parent.get_files\n   for file in files\n       print(\"File name: \" + file.name)\n   end for\nend if</font>",
    "DOC_PORT_GET_LAN_IP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a string with the local IP address of the computer pointed to by this port.",
    "DOC_PORT_IS_CLOSED": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns <color=#33cccc>true</color> if this port is closed, <color=#33cccc>false</color> otherwise.",
    "DOC_PORT_PORT_NUMBER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns an <color=#33cccc>int</color> with the configured port number.",
    "DOC_GENERAL_ACTIVE_USER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the name of the user who is executing the script.",
    "DOC_GENERAL_HOME_DIR": "<mark=#00D0124D><b>[Parameters]</b></mark>\nNone\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with home folder path of the user who is executing the script.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nprint(\"User home path: \" + home_dir)</font>",
    "DOC_BASICS": "<mark=#00D0124D><b>[Clean Syntax]</b></mark>\nPut one statement per line, with no semicolons.\nCode blocks are delimited by keywords (see below). Indentation doesn't matter (except for readability).\n\nComments begin with //.\nAll variables are local by default.\n\n<mark=#00D0124D><b>[if / else if / else / end if]</b></mark>\nUse if blocks to do different things depending on some condition. \nInclude zero or more else if blocks and one optional else block.\n\n<font=\"SourceCodePro-Regular SDF\">if 2+2 == 4 then\n     print(\"math works!\")\nelse if pi > 3 then\n     print(\"pi is tasty\")\nelse if \"a\" < \"b\" then\n     print(\"I can sort\")\nelse\n     print(\"last chance\")\nend if</font>\n\n<mark=#00D0124D><b>[while / end while]</b></mark>\nUse a while block to loop as long as a condition is true.\n\n<font=\"SourceCodePro-Regular SDF\">s = \"Spam\"\nwhile s.len < 50\n   s = s + \", spam\"\nend while\nprint(s + \" and spam!\")</font>\n\n<mark=#00D0124D><b>[for / end for]</b></mark>\nA for loop can loop over any list, including ones easily created with the range function.\n\n<font=\"SourceCodePro-Regular SDF\">for i in range(10, 1)\n   print i + \"...\"\nend for\nprint(\"Liftoff!\")</font>\n\n<mark=#00D0124D><b>[break & continue]</b></mark>\nThe break statement jumps out of a while or for loop. The continue statement jumps to the top of the loop, skipping the rest of the current iteration.\n\n<mark=#00D0124D><b>[:Numbers:]</b></mark>\nAll numbers are stored in full-precision format.\nNumbers also represent true (1) and false (0). \n\n<mark=#00D0124D><b>[Operators]</b></mark>\n<color=orange>standard math</color>: +, -, *, /\n<color=orange>mod (remainder)</color>: %\n<color=orange>power</color>: ^\n<color=orange>logical operators</color>: and, or, not\n<color=orange><color=orange>comparison</color></color>: ==, !=, >, >=, <, <=\n\n<mark=#00D0124D><b>[<color=orange>String</color>s]</b></mark>\nText is stored in strings of Unicode characters. Write strings by surrounding them with quotes.\nIf you need to include a quotation mark in the string, write it twice.\n\nprint(\"OK, \"\"Bob\"\".\")\n\n<mark=#00D0124D><b>[Operators]</b></mark>\n<color=orange>string concatenation</color>: +\n<color=orange>replication</color>: *\n<color=orange>division</color>: /\n<color=orange><color=orange>comparison</color></color>: ==, !=, >, >=, <, <=\n<color=orange>get character i</color>: [i]\n<color=orange>get slice from i up to j</color>: [i:j]\n\n<mark=#00D0124D><b>[Lists]</b></mark>\nCreate a list with square brackets. Then iterate over the list with for, or pull out individual items with a 0-based index in square brackets.\nA negative index counts from the end. Get a slice (subset) of a list with two indices, separated by a colon.\n\n<font=\"SourceCodePro-Regular SDF\">x = [2, 4, 6, 8]\nx[0] // 2\nx[-1] // 8\nx[1:3] // [4, 6]\nx[2]=5 // x now [2,4,5,8]</font>\n\n<mark=#00D0124D><b>[Operators]</b></mark>\n<color=orange>list concatenation</color>: +\n<color=orange>replication</color>: *\n<color=orange>division</color>: /\n<color=orange>get/set element i</color>: [i]\n<color=orange>get slice from i up to j</color>: [i:j]\n\n<mark=#00D0124D><b>[Maps]</b></mark>\nA map is a set of values associated with unique keys. Create a map with curly braces; get or set a single value with square brackets.\nKeys and values may be any type.\n\n<font=\"SourceCodePro-Regular SDF\">m = {1:\"one\", 2:\"two\"}\nm[1] // \"one\"\nm[2] = \"dos\"</font>\n\n<mark=#00D0124D><b>[Operators]</b></mark>\n<color=orange>map concatenation</color>: +\n<color=orange>get/set value with key k</color>: [k]\n<color=orange>get/set value by identifier</color>: .ident\n\n<mark=#00D0124D><b>[:Functions:]</b></mark>\nCreate a function with function(), including parameters with optional default values.\nAssign the result to a variable. Invoke by using that variable.\n\nParentheses are needed on the call only when passing arguments. Use @ to reference a function without invoking.\n\n<font=\"SourceCodePro-Regular SDF\">triple = function(n=1)\n     return n*3\nend function\nprint(triple) // 3\nprint(triple(5)) // 15\nf = @triple\nprint(f(5)) // also 15</font>\n\n<mark=#00D0124D><b>[Classes & Objects]</b></mark>\n\n<font=\"SourceCodePro-Regular SDF\">Shape = {\"sides\":0}\nSquare = new Shape\nSquare.sides = 4\nx = new Square\nx.sides // 4</font>\n\nFunctions invoked via dot syntax get a self variable that refers to the object they were invoked on.\n\n<font=\"SourceCodePro-Regular SDF\">Shape.degrees = function()\n     return 180*(self.sides-2)\nend function\nx.degrees // 360</font>\n\n<mark=#00D0124D><b>[Base Functions]</b></mark>\n<color=orange>Numeric</color><font=\"SourceCodePro-Regular SDF\">\nabs(x)\t\tacos(x)\t\tasin(x)\natan(x)\t\tcos(r)\t\tpi\nround(x,d)\t\trnd\t\trnd(seed)\nsign(x)\t\tsin(r)\t\tsqrt(x)\nstr(x)\t\ttan(r)\t\tchar(i)\nfloor(i)</font>\n\n<color=orange>String</color><font=\"SourceCodePro-Regular SDF\">\n.hasIndex(i)\t.indexOf(s)\n.len\t\t.val\n.remove(s)\t\t.lower\n.code\t\t.upper\n.lastIndexOf(i)\t.trim\n.replace(s, s)\t.split(s)</font>\n\n<color=orange>List/Map</color><font=\"SourceCodePro-Regular SDF\">\n.pull\t.indexOf(x)\n.indexes\t.values\n.len\t.sum\n.push(x)\t.pop\n.shuffle\t.remove(i)\n.hasIndex(i)\nrange(from, to, step)\nslice(l, from, to)</font>\n\n<color=orange>List-specific</color><font=\"SourceCodePro-Regular SDF\">\n.reverse\n.join(s)</font>\n\n<color=orange>Other</color>\n<font=\"SourceCodePro-Regular SDF\">print(s)</font>",
    "DOC_ROUTER_ESSID_NAME": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the <color=orange>ESSID</color> value of the router.",
    "DOC_ROUTER_BSSID_NAME": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the <color=orange>BSSID</color> value of the router.",
    "DOC_GENERAL_PROGRAM_PATH": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the path of the program that is running at this time.",
    "DOC_GENERAL_USER_MAIL_ADDRESS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the user's email address that is executing this script.",
    "DOC_GENERAL_USER_BANK_NUMBER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the bank account number of the user who is executing this script.",
    "DOC_GENERAL_EXIT": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] [opt] <color=#33cccc>string</color> message\n\n<mark=#00D0124D><b>[Description]</b></mark>\nStops the execution of the script at the time this method is executed. Optionally you can pass a <color=#33cccc>string</color> as a message that will be printed in the terminal when the program ends.\n\n<mark=#00D0124D><b>[Example]</b></mark> <font=\"SourceCodePro-Regular SDF\">\nprint (\"Hello\")\nexit (\"I finish the program\")\nprint (\"bye\") </font>\n\n<color=orange>#Output</color>:\nHello\nI finish the program",
    "DOC_FILE_CHMOD": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> permissions\n[2] [opt] isRecursive\n\n<mark=#00D0124D><b>[Description]</b></mark>\nModifies the file's permissions\n\nTakes a permissions <color=#33cccc>string</color> (e.g. u+wr) and optional recursive flag (<color=#33cccc>int</color> 0 or 1)\n\nIf the file is a folder and the recursive flag is 1, the permissions change will apply recursively, to all the files and folders inside the folder.",
    "DOC_FILE_PERMISSIONS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the current file permissions.",
    "DOC_FILE_OWNER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the name of the file owner.",
    "DOC_FILE_SIZE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the size of the file in bytes.",
    "DOC_COMPUTER_TOUCH": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> path\n[2] <color=#33cccc>string</color> name\n\n<mark=#00D0124D><b>[Description]</b></mark>\nCreate an empty text file. Returns <color=#33cccc>true</color> if the file has been created, <color=#33cccc>false</color> otherwise.",
    "DOC_FILE_SET_CONTENT": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> text\n\n<mark=#00D0124D><b>[Description]</b></mark>\nSave the text in the file. The content will be overwritten if there is already text saved in the file.",
    "TOUCH_USAGE": "<b>Usage: touch [path_new_file]</b>",
    "TOUCH_HELP": "Used for the creation of empty files.",
    "MASTERKEY_USAGE": "Usage: masterkey [public IP] [port] [opt:user]\nUsage: masterkey [public IP] [local IP] [opt:user]",
    "DOC_SHELL_CONNECT_SERVICE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ipAdress\n[2] <color=#33cccc>int</color> port\n[3] <color=#33cccc>string</color> user\n[4] <color=#33cccc>string</color> password\n\n<mark=#00D0124D><b>[Description]</b></mark>\nConnect to a remote service. Returns a <color=#33cccc>shell</color> if the connection has been established correctly.",
    "DOC_SHELL_START_TERMINAL": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nLaunch an active terminal from the shell.",
    "DOC_SHELL_HOST_COMPUTER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the <color=#33cccc>computer</color> associated with the shell.",
    "DOC_SHELL_SCP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> path_orig\n[2] <color=#33cccc>string</color> path_dest\n[3] <color=#33cccc>shell</color> remoteShell\n\n<mark=#00D0124D><b>[Description]</b></mark>\nCopy a file from one computer to the other through the network.\n\n<mark=#00D0124D><b>[Example]</b></mark> <font=\"SourceCodePro-Regular SDF\">\nhostShell = get_<color=#33cccc>shell</color>\nremoteShell = hostShell.connect_service (\"120.123.12.12\", 22, \"username\", \"mypass\")\nhostShell.scp(\"/home/user1/file.txt\", \"/home/user2/downloads\", remoteShell)\n</font>",
    "DOC_GENERAL_GET_SHELL": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] [opt] <color=#33cccc>string</color> user\n[2] [opt] <color=#33cccc>string</color> password\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the shell that is executing the script if it is called without parameters. \nPassing a username and password, it returns a shell with those credentials if are correct.",
    "DOC_COMPUTER_SHOW_PROCS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the list of active processes on the machine.",
    "DOC_GENERAL_INCLUDE_LIB": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> lib_path\n\n<mark=#00D0124D><b>[Description]</b></mark>\nIncludes an external library to be used in scripting. If the library has been included correctly, it will return an object of corresponding type with the library, <color=#33cccc>null</color> otherwise.\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nnewTools = include_lib(\"<color=yellow>/lib</color>/somelib.so\")\nif not newTools then exit(\"Missing lib!\")\nnewTools.someMethod(\"foo\")\n</font>",
    "DOC_CRYPTO_DECIPHER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> encrypted_pass\n\n<mark=#00D0124D><b>[Description]</b></mark>\nStart the process of decrypting the password.",
    "DOC_GENERAL_USER_INPUT": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] [opt] <color=#33cccc>string</color> promptMsg\n[2] [opt] <color=#33cccc>bool</color> passwordMode\n[3] [opt] <color=#33cccc>bool</color> anyKey\n\n<mark=#00D0124D><b>[Description]</b></mark>\nIt puts the program on hold to receive the user input, which will be processed as a <color=#33cccc>string</color>. If the password mode is activated, the input text will be hidden with asterisks. If the anyKey argument is <color=#33cccc>true</color>, the entered character will be captured without pressing enter.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nname = user_input(\"Type your name: \")\npass = user_input(\"Type your password: \", <color=#33cccc>true</color>)\nprint(\"Good! your name is \" + name +\". And your  password is \" + pass)\n</font>",
    "DOC_COMPUTER_CREATE_USER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> user\n[2] <color=#33cccc>string</color> password\n\n<mark=#00D0124D><b>[Description]</b></mark>\nCreate a user on the machine, with the specified name and password. It is necessary to be root to be able to execute the method. Returns <color=#33cccc>true</color> on success, otherwise it returns an error <color=#33cccc>string</color>.",
    "DOC_COMPUTER_DELETE_USER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> user\n[2] [opt] <color=#33cccc>bool</color> deleteHome\n\n<mark=#00D0124D><b>[Description]</b></mark>\nIt deletes the indicated user from the computer, also deleting its home folder optionally. \nBy default, if the optional parameter is not passed, the home folder will not be deleted.\nIt is necessary to be root to be able to execute the method. Returns <color=#33cccc>true</color> on success, <color=#33cccc>false</color> otherwise.",
    "DOC_COMPUTER_CHANGE_PASSWORD": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> user\n[2] <color=#33cccc>string</color> password\n\n<mark=#00D0124D><b>[Description]</b></mark>\nChange the password of an existing user on the machine, for a new one.\nIt is necessary to be root to be able to execute the method. Returns <color=#33cccc>true</color> on success, <color=#33cccc>false</color> otherwise.",
    "DOC_COMPUTER_NETWORK_DEVICES": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a string with the list of network devices available on the computer.",
    "DOC_CRYPTO_AIRCRACK": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> filePath\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the password generated from the file created by aireplay.",
    "DOC_CRYPTO_AIRMON": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> option\n[2] <color=#33cccc>string</color> device\n\n<mark=#00D0124D><b>[Description]</b></mark>\nEnables or disables the monitor mode of a network device. The option parameter can only be \"start\" or \"stop\".",
    "SCANLIB_USAGE": "<b>Usage: scanlib [path_lib_file]</b>",
    "SCANLIB_DETAIL": "Analyze the provided library to search for vulnerabilities.",
    "DOC_METAXPLOIT_LOAD": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> lib_path\n\n\n<mark=#00D0124D><b>[Description]</b></mark>\nLoad the library in memory and return it as a <color=#33cccc>metalib</color> type if the process was successful.",
    "DOC_METAXPLOIT_NET_USE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ip_address\n[2] [opt] port\n\n<mark=#00D0124D><b>[Description]</b></mark>\nIt connects to the specified address and establishes a null session to gain access to a library remotely.\nThis type of attack is only available for services that work remotely.\nIf no port is specified, it will connect directly to the router.\nIf the process has been executed correctly, an object of type <color=#33cccc>net_session</color> will be returned.",
    "DOC_METAXPLOIT_SCAN": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>MetaLib</color> metalib\n\n<mark=#00D0124D><b>[Description]</b></mark>\nAnalyze the memory areas occupied by the library in search of vulnerabilities. Returns a <color=#33cccc>list</color> with the affected memory zones.",
    "DOC_METAXPLOIT_SCAN_ADDRESS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>MetaLib</color> metalib\n[2] <color=#33cccc>string</color> mem_address\n\n<mark=#00D0124D><b>[Description]</b></mark>\nIt analyzes a specific memory address and shows the vulnerable parts that can be exploited.",
    "DOC_METALIB_OVERFLOW": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> mem_address\n[2] <color=#33cccc>string</color> unsec_value\n[3] [opt] extra_args\n\n<mark=#00D0124D><b>[Description]</b></mark>\nExploits the indicated vulnerability through the <color=orange>buffer overflow</color> method.\nThe object returned can be of various types or even not return anything, so it is advisable to use the <color=#0FABFFFF>typeof</color> method with the object returned.\nDepending on the result, it may be necessary to pass extra arguments so that the exploit runs correctly, for example in the case of a password change.",
    "DOC_METALIB_LIB_NAME": "<mark=#00D0124D><b>[Parameters]</b></mark>\nNone\n\n<mark=#00D0124D><b>[Description]</b></mark>\nPrint the name of the library.",
    "DOC_METALIB_VERSION": "<mark=#00D0124D><b>[Parameters]</b></mark>\nNone\n\n<mark=#00D0124D><b>[Description]</b></mark>\nPrint the version of the library.",
    "DOC_NETSESSION_DUMP_LIB": "<mark=#00D0124D><b>[Parameters]</b></mark>\nNone\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the <color=#0FABFFFF>metalib</color> associated with the remote service.\n\nFor example, connecting to a computer with the <color=orange>ssh</color> service will return a <color=#0FABFFFF>metalib</color> <color=orange>lib<color=orange>ssh</color></color> object.\n\nIn the case of connecting to a router, it returns a <color=#0FABFFFF>metalib</color> <color=orange>kernel_router</color> object.",
    "DOC_ROUTER_DEVICE_PORTS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ip_address\n\n<mark=#00D0124D><b>[Description]</b></mark>\nTakes a LAN IP address and returns a <color=#33cccc>list</color> with open ports accessible in the network.",
    "DOC_ROUTER_DEVICES_LAN_IP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>list</color> with any computer whose <color=orange>gateway</color> is the current device with the ips of the routers and switches that it can reach with a ping. \nSome of the returned addresses could be behind a firewall",
    "DOC_INJECT_LIB": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>file</color> library\n\n<mark=#00D0124D><b>[Description]</b></mark>\nInjects the local library passed as a parameter to the victim's computer, if the library through which the null connection is being made has a vulnerability that allows it.\n\nThis is useful to be able to use <color=orange>include_lib</color> from a library that does not physically exist on the victim's computer, such as metaxploit.so.\n\nIf the injection is done correctly, the terminal will be busy keeping the library in memory of the victim's computer.\n\nTo stop the process, press the key combination <color=#0FABFFFF>Ctrl+C</color> on the terminal.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nmetaxploit = include(\"metaxploit\")\nlibrary = get_shell.host_computer.File(\"/lib/metaxploit.so\")\nnull_session = metaxploit.net_use( \"50.85.78.47\", 22 )\nnull_session.inject_lib(library)</font>",
    "FILE_MODIFIED_ASK": "The file has been modified, save changes?",
    "CHOWN_USAGE": "<b>Usage: chown [opt:-R] [owner] [path file/folder]</b>\nExample: chown myuser document.txt",
    "CHGRP_USAGE": "<b>Usage: chgrp [opt:-R] [new group] [path file/folder]</b>\nExample: chgrp mygroup document.txt",
    "GROUPADD_USAGE": "<b>Usage: groupadd [user] [new group]</b>\nExample: groupadd john staff",
    "GROUPDEL_USAGE": "<b>Usage: groupdel [user] [group]</b>\nExample: groupdel john staff",
    "GROUPS_USAGE": "<b>Usage: groups [username]</b>\nExample: groups root",
    "ING_TITLE_FORCE_ONLINE": "Online user",
    "ING_FORCE_ONLINE": "Hello <NAME>.\nI am the administrator <NAME_ADMIN> of your workstation in <COMPANY_NAME>.\n\nI am carrying out maintenance tasks and an error has occurred in your account.\nI need you to connect as soon as possible to your workstation, so I can check that everything is correct.\n\nPlease, let me know when you are ready.\nRegards.",
    "ING_WRONG_COMPANY": "Ok, this is weird, I do not work there ...",
    "ING_USER_CONNECTED": "I just entered to the server with my user.\nI will be aware of the mail in case you need something else.",
    "ING_USER_ALREADY_CONNECTED": "Hey, I was already logged.",
    "ING_FORCE_ONLINE_ADMIN": "Hello <NAME_ADMIN>.\nI'm <NAME>, I work with you on <COMPANY_NAME>.\n\nI have to finish some pending tasks remotely, but when I enter the credentials of my account, the system alerts me that someone has tried to enter into my account in an unauthorized way.\n\nI am worried about possible theft of data, so as you are the administrator of the system I will let you know in case you have to check something.\nThanks for your time.",
    "ING_TITLE_FORCE_ONLINE_ADMIN": "Admin online",
    "ING_WRONG_ADMIN": "I'm sorry, it seems you're wrong, I'm not the administrator of the system.\nI guess who you're looking for is <NAME_ADMIN>\nGood luck, see you at work.",
    "ING_NO_SENSE": "What? That makes no sense.",
    "ING_ADMIN_CONNECTED": "Thanks for the warning, I will connect and check that everything is fine.",
    "ING_ADMIN_ALREADY_CONNECTED": "Thanks for the warning, I was already connected, I'll check that everything is fine.",
    "ING_INFO_SYSTEM": "Hey!\n\nSorry to bother you, I'm <NAME>, your co-worker :)\n\nCan you help me?\nI do not know what I've done, but I've accidentally deleted a library from my computer and I do not want to bother the administrator. The last time he did not take it very well.\n\nI guess I'm not very good with computers :D\n\nWould you mind telling me which version of the library <LIB_NAME> you have installed?\n\nI have understood that the same versions are used in all machines, so I can restore the version I had without having to tell the administrator.\nThank you!",
    "ING_ADMIN_SUSP": "This is very strange, I am the system administrator and I do not remember that you have deleted any library before.\nWho you really are?",
    "ING_SAME_NAME": "I do not understand anything ... That's me! I think I should tell someone about this.",
    "ING_NO_INFO": "I'm sorry, I can not send you that information.",
    "ING_WRONG_LIB": "Oops, it seems like something strange happens to my library. It seems that someone has ...modified it?\n\nAsk me again in a little while to see if I have solved it by then.",
    "ING_LIB_VERSION_MAIL": "Do not worry, there is no problem.\nThe <LIB_NAME> version that I have installed is: <LIB_VERSION>",
    "ING_LIB_NOT_FOUND": "I'm sorry, but I do not have that library installed on my computer.",
    "ING_TITLE_INFO_SYSTEM": "System information",
    "KILL_USAGE": "<b>Usage: kill [PID]</b>\nExample: kill 8542",
    "GAME_ADMIN_MSG_UPDATE": "<align=\"center\"><b>New game update available!</b></align>\\n\\nThe server is going to shut down to apply the update. It will be available in a few minutes.\\n\\nYou need to update your game client to be able to connect to the server again.\\n\\nIf you do not see the update available, restart Steam.",
    "GAME_ADMIN_MSG_UPDATE_WIPE": "<b>New game update available!</b>\\n\\nThe server is going to shut down to apply the update. It will be available in a few minutes.\\n\\nYou need to update your game client to be able to connect to the server again.\\n\\nIf you do not see the update available, restart Steam.\\n<color=red>Wipe needed. Backup your data!",
    "GAME_ADMIN_MSG_RESTART": "The game server is going to restart for maintenance.\\n\\nIt will be available again in a few minutes.",
    "GAME_ADMIN_MSG_RESTART_QUICK": "The game server is going to restart for maintenance.\\n\\nIt will be available again in a minute.",
    "GAME_OVER": "According to the records the system administrator <ADMIN_NAME> has reported that you have been discovered performing an unauthorized intrusion into their systems:\n\n<b>Public IP: <PUBLIC_IP>\nLan IP: <LAN_IP>\n<ADD_INFO></b>\n\n<IS_STRIKE>",
    "GAME_OVER_TITLE": "We have received a notice from the authorities informing that illegal services are being carried out from our services.",
    "GAME_OVER_STRIKE": "Receive this type of notices is clearly against our rules. We ask you to be more careful in the future, or we will have to remove your computer from our services.",
    "GAME_OVER_FINAL": "Thanks to our policy of anonymity we have not provided your personal information to the authorities.\n\nHowever receive this type of notices is clearly against our rules.\nTherefore we have proceeded to deactivate your remote computer and remove its contents.\n\nYou are free to re-use our services whenever you want but we recommend you to be more cautious in the future.",
    "SCANROUTER_USAGE": "<b>Usage: scanrouter [ip address]</b>",
    "SCANROUTER_DETAIL": "Connects to a router via its local or public IP and prints out extended information such as firewall configuration and kernel version.",
    "MOD_TRANS_ERROR": "The steam connection could not be made.\n\nYou can work on the translation, but you will not be able to upload it to the workshop.\n\nPlease, restart the game and Steam and try again.",
    "UI_PREFERENCES": "Preferences",
    "UI_HELP": "Help",
    "UI_PROGRAMS": "Programs",
    "UI_SHUTDOWN": "Shutdown",
    "UI_REBOOT": "Reboot",
    "TUTORIAL_EXPLOITS1": "In Hackshops there are usually jobs available.\n\nIn addition to the tools and jobs, some hackers publish their exploits on these pages.",
    "TUTORIAL_EXPLOITS2": "The main services and programs of a computer depend on the libraries they have installed. For example, an <color=orange>ssh</color> server has the <color=orange>lib<color=orange>ssh</color>.so</color> library installed in the system.\n\nThese libraries usually have vulnerabilities that can be attacked to gain access to the machine.",
    "TUTORIAL_EXPLOITS3": "As these <color=#33cccc>vulnerabilities</color> are exploited, <color=#33cccc>library</color> developers will discover and patch them, publishing updates so that any system administrator can patch it.\n\nDue to the nature of the software development, <color=#33cccc>library</color> updates will bring new errors and <color=#33cccc>vulnerabilities</color> that users may exploit.\n\nTherefore some versions will be safer than others, however the latest version is not necessarily the safest.",
    "TUTORIAL_EXPLOITS4": "To search for <color=orange>exploits</color> in the store, you have to select the <color=#33cccc>library</color> and the version you want to hack.\n\nAfter pressing search, a list will appear with the <color=orange>exploits</color> published at that time.",
    "TUTORIAL_EXPLOITS5": "You can classify the exploits into two classes: <color=orange>Local use</color> and <color=orange>Remote use</color>\n\n<color=orange>Remote exploits</color> are those that can be run from any computer to attack any remote machine connected to the internet.\n\nThis type of vulnerability is reserved for libraries of programs that have services open to the outside, such as <color=#0FABFFFF>ssh</color>, <color=#0FABFFFF>ftp</color>, <color=#0FABFFFF>smtp</color> and <color=#0FABFFFF>sql</color>\n\nIn the description of the exploit in the store, it is detailed what type of <color=orange>permissions</color> are obtained if the exploit is executed successfully.\n\nFor example, if executing an exploit gives you access to a terminal on the victim's computer, depending on the type of exploit you will have <color=#33cccc>root</color>, <color=#33cccc>guest</color> or <color=#33cccc>common user</color> access on the machine.",
    "TUTORIAL_EXPLOITS6": "The <color=orange>exploits</color> of <color=orange>Local use</color> can only be executed from the victim's machine since they use <color=#33cccc>vulnerabilities</color> in the libraries of the OS such as, <color=#0FABFFFF>init.so</color>, <color=#0FABFFFF>kernel_module.so</color> and <color=#0FABFFFF>net.so</color> that do not have direct access to the outside.\n\nThis means that in order to successfully run a local exploit, you first need to have gained access, at least as a <color=#33cccc>guest</color>, to the remote machine.\n\nUsually, this type of <color=orange>exploits</color> are used to escalate privileges on the remote machine. For example if you have access to the victim's machine but only with the <color=#33cccc>guest</color> account you will not be able to do much.\n\nBut you can upload a local exploit to the victim's machine that gives you <color=#33cccc>root</color> privileges.",
    "TUTORIAL_EXPLOITS7": "Since some <color=#33cccc>vulnerabilities</color> require that specific behaviours occur in the program in order to exploit it, some exploits need certain requirements to be met in order to run successfully.\n\nIt is advisable to save some money and hire a rented server, where you can do your tests and prepare the next attack in private without the danger of alerting the authorities.",
    "TUTORIAL_EXPLOITS8": "When you select an exploit to buy it, you have the option to download the <color=#33cccc>source code</color> or the <color=#33cccc>compiled version</color>.\n\nIf you want to download the exploit <color=#33cccc>source code</color> to review and compile it yourself with the <color=orange>CodeEditor</color>, check the <b>\"Source code version\"</b> box. \n\nIf instead you want to download the exploit ready to be used in the <color=orange>Terminal</color>, leave the box unchecked.",
    "TUTORIAL_EXPLOITS9": "Libraries often have many more hidden <color=#33cccc>vulnerabilities</color> than those found in <color=orange>exploits</color> published in Hackshops.\nThese <color=#33cccc>vulnerabilities</color> can be scanned with the <color=#0FABFFFF>scanlib</color> tool to program your own <color=orange>exploits</color>.\n\nIf you are interested in programming, check the \"scripting\" section in the <color=#0FABFFFF>Manual</color> for more information.\n\nThis is all for now, you can close this window.",
    "MANUAL_EXPLOITS": "<mark=#00D0124D><b>[Libraries & Exploits]</b></mark>\n\nThe main services and programs of a computer depend on the libraries they have installed. For example, an <color=#0FABFFFF>ssh</color> server has the <color=#0FABFFFF>lib<color=#0FABFFFF>ssh</color>.so</color> library installed in the system.\n\nThese libraries usually have <color=#33cccc>vulnerabilities</color> that can be attacked to gain access to the machine.\n\nAs these <color=#33cccc>vulnerabilities</color> are exploited, library developers will discover and patch them, publishing updates so that any system administrator can patch it.\n\nDue to the nature of the software development, library updates will bring new errors and <color=#33cccc>vulnerabilities</color> that users may exploit.\n\nTherefore some versions will be safer than others, although not necessarily the latest version must be the safest.\n\nYou can classify the <color=orange>exploits</color> into two classes:\n\n<mark=#00D0124D><b>[Remote use]</b></mark>\n\nRemote <color=orange>exploits</color> are those that can be run from any computer to attack any remote machine connected to the internet.\n\nThis type of vulnerability is reserved for libraries of programs that have services open to the outside, such as <color=#0FABFFFF>ssh</color>, <color=#0FABFFFF>ftp</color>, <color=#0FABFFFF>smtp</color> and <color=#0FABFFFF>sql</color>\n\nIn the description of the exploit in the store, it is detailed what type of permissions are obtained if the exploit is executed successfully.\n\nFor example, if executing an exploit gives you access to a terminal on the victim's computer, depending on the type of exploit you will have <color=#33cccc>root</color>, <color=#33cccc>guest</color> or <color=#33cccc>common user</color> access on the machine.\n\n<mark=#00D0124D><b>[Local use]</b></mark>\n\nThe <color=orange>exploits</color> of local use can only be executed from the victim's machine since they use <color=#33cccc>vulnerabilities</color> in the libraries of the OS such as, <color=#0FABFFFF>init.so</color>, <color=#0FABFFFF>kernel_module.so</color> and <color=#0FABFFFF>net.so</color> that do not have direct access to the outside.\n\nThis means that in order to successfully run a local exploit, you first need to have gained access, at least as a <color=#33cccc>guest</color>, to the remote machine.\n\nUsually, this type of <color=orange>exploits</color> are used to escalate privileges on the remote machine. For example if you have access to the victim's machine but only with the <color=#33cccc>guest</color> account you will not be able to do much.\n\nBut you can upload a local exploit to the victim's machine that gives you <color=#33cccc>root</color> privileges.\n\n<mark=#00D0124D><b>[Requirements]</b></mark>\n\nSince some <color=#33cccc>vulnerabilities</color> require that specific behaviours occur in the program in order to exploit it, some <color=orange>exploits</color> need certain requirements to be met in order to run successfully.\n\nIt is advisable to save some money and hire a rented server, where you can do your tests and prepare the next attack in private without the danger of alerting the authorities.\n",
    "DOC_COMPUTER_CLOSE_PROGRAM": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>int</color> PID\n\n<mark=#00D0124D><b>[Description]</b></mark>\nClose the program associated with the PID. To show the list of the running programs along with their PIDs use the <color=#0FABFFFF>ps</color> command.",
    "DOC_COMPUTER_CONNECT_WIFI": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>string</color> net_device\n<color=#33cccc>string</color> bssid\n<color=#33cccc>string</color> essid\n<color=#33cccc>string</color> password\n\n<mark=#00D0124D><b>[Description]</b></mark>\nConnect to the indicated Wifi network. Returns true if the connection was successful.",
    "DOC_COMPUTER_CREATE_GROUP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>string</color> username\n<color=#33cccc>string</color> groupname\n\n<mark=#00D0124D><b>[Description]</b></mark>\nCreate a new group associated with an existing user on the machine. It is necessary to be root to be able to execute the method.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\n//We will create the staff group for the regular user myuser\noutput = get_shell.host_computer.create_group(\"myuser\", \"staff\")\nif output == true then exit(\"Group \" + group + \" added to user \" + user)\nif output then exit(output)\nprint(\"Error: the group could not be created.\")\n</font>",
    "DOC_COMPUTER_DELETE_GROUP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> username\n[2] <color=#33cccc>string</color> groupname\n\n<mark=#00D0124D><b>[Description]</b></mark>\nDelete the indicated user group. It is necessary to be root in order to execute this method.",
    "DOC_COMPUTER_GROUPS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> username\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the list of groups created in the indicated user.",
    "DOC_COMPUTER_WIFI_NETWORKS": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> net_device\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a list of the Wi-Fi networks that are available.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\ncomputer = get_shell.host_computer\nnetworks = computer.wifi_networks(\"wlan0\")\n\ninfo = \"BSSID PWR ESSID\"\nfor network in networks\n   info = info + \"\\n\" + network\nend for\nprint(format_columns(info))\n</font>",
    "DOC_CRYPTO_SMTP_USER_LIST": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ip_address\n[2] <color=#33cccc>int</color> port\n\n<mark=#00D0124D><b>[Description]</b></mark>\n<color=orange>SMTP</color> services are mail services. When using this method with the IP of a mail server, due to a vulnerability in the service, it returns a <color=#33cccc>list</color> of the existing users on the computer where the <color=orange>SMTP</color> service is working. \nIf these users also have an email account registered on the <color=orange>SMTP</color> server, it will be indicated in the <color=#33cccc>list</color>.",
    "DOC_FILE_GROUP": "<mark=#00D0124D><b>[Parameters]</b></mark>\nNone\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the name of the group to which this file belongs.",
    "DOC_FILE_SET_GROUP": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> groupname\n[2] [opt] <color=#33cccc>int</color> isRecursive\n\n<mark=#00D0124D><b>[Description]</b></mark>\nApply a group to this file. By default, the group does not apply recursively. To apply the group recursively, the optional parameter must be 1.",
    "DOC_GENERAL_PRINT": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> message\n\n<mark=#00D0124D><b>[Description]</b></mark>\nPrint on the Terminal the message.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nprint(\"Hello world!\")\n\n<color=orange>#Output</color>\nHello world!\n</font>",
    "DOC_SHELL_PUT": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> path_orig\n[2] <color=#33cccc>string</color> path_dest\n[3] <color=#33cccc>shell</color> remoteShell\n\n<mark=#00D0124D><b>[Description]</b></mark>\nCopy a file from one computer to the other through the network.\n\n<mark=#00D0124D><b>[Example]</b></mark> <font=\"SourceCodePro-Regular SDF\">\nhostShell = get_<color=#33cccc>shell</color>\nremoteFtpShell = hostShell.connect_service(\"120.123.12.12\", 21, \"username\", \"mypass\")\nremoteFtpShell.put(\"/home/user1/file.txt\", \"/home/user2/downloads\", hostShell)\n</font>\n",
    "MOD_TRANS_IMG": "To include the <color=#0FABFFFF>preview image</color> that will be seen in the Steam workshop, a <color=orange>jpg</color> file with the same name as the translation file must be included in the following path:",
    "TUTO_CODE_EDITOR": "All available terminal programs such as <color=#0FABFFFF>ls</color>, <color=#0FABFFFF>cat</color>, <color=#0FABFFFF>mv</color>, etc. are programmed with the GreyScript language and compiled into executables to be used in the terminal.\n\nIn the <color=orange><color=#33cccc>CodeEditor</color></color> you can create your own terminal programs and exploits.\n\nFor more information see the <color=orange>Scripting > Basics</color> section in the <color=orange>Manual</color>.\n\nWithin the manual you can view the source code of the mentioned programs, by clicking on the \"Open code\" button in the manual entries of the commands that use scripting.\n\nIf you do not want to use the <color=orange><color=#33cccc>CodeEditor</color></color> you can continue progressing in the game normally, using the too<color=#0FABFFFF>ls</color> and exploits that you will find on the net.",
    "CHATD_USAGE": "<b>Usage: chatd [start|stop]</b>\nExample: chatd start",
    "WRONG_PC_OWNERSHIP": "You must be the owner of this machine to install hardware.",
    "INSTALLED_HARDWARE_REMOTE": "The configuration is correct! \n\nYou need to restart the machine so that our systems install the new hardware.",
    "HARDWARE_INSTALLED_REMOTE": "The hardware will be received very soon.\nAccess the installation panel to configure your new hardware.",
    "IFCONFIG_USAGE": "<b>Usage: ifconfig</b>\n<b>Usage: ifconfig [net interface] [ip address] gateway [ip address]</b>\nExample: ifconfig\nExample: ifconfig eth0 192.168.0.30 gateway 192.168.0.1",
    "DOC_COMPUTER_CONNECT_ETHERNET": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>string</color> net_device\n<color=#33cccc>string</color> local_address\n<color=#33cccc>string</color> gateway\n\n<mark=#00D0124D><b>[Description]</b></mark>\nSet up a new IP address on the machine through the ethernet connection.\nReturns a <color=#33cccc>string</color> with the error message if the connection failed. In case of success, an empty <color=#33cccc>string</color> is returned.",
    "DOC_COMPUTER_NETWORK_GATEWAY": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a string with the gateway configured on the computer.",
    "DOC_COMPUTER_ACTIVE_NET_CARD": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the keyword <color=orange>WIFI</color> if the current device is connected to a router by WiFi, if it is connected by cable a <color=#33cccc>string</color> with the keyword <color=orange>ETHERNET</color> is returned.",
    "UPGRADE_HW_ROUTER": "Routers and switches hardware cannot be updated.",
    "SCANLAN": "<color=#0FABFFFF>ScanLan</color> is a powerful tool that visually shows the details of the network you are connecting to, allowing you to see how the network is structured, as well as all the IP addresses available on the LAN.\n\nAlthough a network is very large does not mean that it has more security than a small network. The security of the LAN depends on the configuration of it.\n\n<mark=#00D0124D><b>[Rules]</b></mark>\n\nIn the network you can find, in addition to computers, routers, switches and hubs.\nThe ping simulation action will help you know which parts of the network you can reach from the current machine. The ping command is also available from the terminal.\n\nYou can ping any computer on the network whose <color=orange>gateway</color> is a router. If the <color=orange>gateway</color> is a switch or another computer, you can only ping if you are on the same subnet.\nYou can also ping between devices directly like routers or switches.\n\n<mark=#00D0124D><b>[Hardware Firewall]</b></mark>\n\nA firewall configured on a router or switch will prevent any connection from passing if there is a <color=orange>DENY</color> rule that affects the connection. This applies to any firewall that is between the source and the destination.\n\nThe <color=orange>ALLOW</color> rule takes precedence over the <color=orange>DENY</color> rule, so even though a firewall has a <color=orange>DENY</color> rule of any address and any port configured, it will let through the connection that matches the <color=orange>ALLOW</color> rule, if it exists.\n\nThe ping command is not blocked by the firewall, so you can know if you can reach a machine in the event that there was no firewall preventing it.\n\n<mark=#00D0124D><b>[Hubs]</b></mark>\n\nThe hubs connect to the devices exclusively physically, therefore the hubs do not have an IP address, since they serve to propagate and organize the connections to the devices connected to them.\nBut hubs are more insecure than switches or routers against sniffers. If a sniffer is listening on a computer that is connected to a hub, it will receive network packets from any other device that is connected to that same hub.\n\n<mark=#00D0124D><b>[Lan Routers]</b></mark>\n\nWithin the local network, some routers may have the wifi module activated, allowing you to connect to other machines wirelessly within the network. These networks are not listed in the iwlist command since they are not public access connections.\n\nThe bssid and essid information can be found in <color=#0FABFFFF>ScanLan</color> or through the scripting methods router.bssid_name and router.essid_name.\n\n<mark=#00D0124D><b>[Switches]</b></mark>\n\nThe switches are very similar to routers, except that they do not have a Wi-Fi module or portforwarding configuration. Furthermore, unlike routers, they do not route connections to connected computers, so computers can only be accessed behind a switch if you are on the same subnet.",
    "SCRIPT_ERROR": "Oops, a game error has occurred that has caused a <color=orange>crash</color> in the script you just ran.\n\nPlease report the error along with the steps you have taken for review.\nThank you!",
    "DOC_SHELL_PING": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> address\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns <color=#33cccc>true</color> if the remote address could be reached, <color=#33cccc>false</color> otherwise. Firewalls do not block ping requests.",
    "PING_USAGE": "<b>Usage: ping [ip address]</b>\nExample: ping 192.168.0.1",
    "DOC_GENERAL_GET_SWITCH": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ip_address\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns the switch on the local network whose IP matches, otherwise it returns null.",
    "DOC_METAXPLOIT_SNIFFER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1][opt] bool <color=orange>saveEncSource</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nThe terminal listens to the network packets of any connection that passes through this device. \nWhen any connection information is captured, it prints a <color=#33cccc>string</color> with the obtained data. \nIt can save the source code of the encode script if <color=orange>saveEncSource</color> is <color=orange>true</color>.\nNull is returned if the listen could not be started.",
    "DOC_GENERAL_WAIT": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>float</color> seconds\n\n<mark=#00D0124D><b>[Description]</b></mark>\nPauses the script for the indicated time. If duration is not specified, the default value is 1 second.",
    "ING_TITLE_LOGIN_SERVICE": "Remote login",
    "ING_LOGIN_SERVICE": "Hello <NAME>.\nI am the administrator <NAME_ADMIN> of your workstation at <COMPANY_NAME>.\n\nI am performing maintenance on the service <SERVICE> installed in the machine.\nI need to connect to the server as soon as possible at the local address <LOCAL_IP>, in order to verify that everything is correct.\n\nPlease let me know when you're ready.\nRegards.",
    "ING_INVALID_IP": "It seems to me that this IP is not valid ...",
    "ING_INVALID_SERVICE": "I think that service is not valid...",
    "ING_WRONG_LOCAL_IP": "Sorry I don't have access to that local address.",
    "ING_WRONG_SERVICE": "I cannot access the machine, the service you indicate is not installed.",
    "SNIFFER_DETAIL": "If the sniffer has been run on a device connected to a hub, it will capture all the data that is directed to any other device connected to the same hub.",
    "DOC_GENERAL_CLEAR_SCREEN": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nDelete any text from the terminal.",
    "DOC_CRYPTO_AIREPLAY": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> bssid\n[2] <color=#33cccc>string</color> essid\n[3] [opt] <color=#33cccc>int</color> maxAcks\n\n<mark=#00D0124D><b>[Description]</b></mark>\nUsed to inject frames on wireless <color=#33cccc>int</color>erfaces.\n\nOnce the command with <color=orange>Control+C</color> is stopped, it will save the captured information in a text file called <color=orange>file.cap</color> in the path where the terminal is currently located.\n\nAlternatively, a maximum of captured <color=orange>acks</color> can be specified for the command to stop automatically, saving the <color=orange>file.cap</color> file as described above.\nIn the event that there is an error, a <color=#33cccc>string</color> will be returned with the message indicating the problem.",
    "TUTORIAL_REMOTE_CONN12": "It is recommended that you copy the <color=#0FABFFFF>ScanLan</color> program on the remote machine and run it.\n<color=#0FABFFFF>ScanLan</color> is a powerful program that shows you the <color=orange>net</color>work configuration in which the computer is located.\n\nIt is especially useful to solve the <color=#33cccc>missions</color> and know which is the victim's machine according to its <color=#33cccc>local address</color>, data that is indicated in the details of the <color=#33cccc>missions</color>.\n\nKeep in mind that when you scan a public address with <color=#0FABFFFF>nmap</color>, it may not show you all the computers on the <color=orange>LAN</color> that have active services, since some computers will not have the port configu<color=orange>red</color> on the router and therefore will not be visible from the outside.\n\nTo access these computers, you will first have to access some other machine that has a port open to the outside, or gain a <color=orange>shell</color> access to the router, and from there get to the machine on the <color=orange>LAN</color>.\n\nYou can see more details about <color=#0FABFFFF>ScanLan</color> in the <color=#0FABFFFF>Manual</color>.",
    "MISSION_TIP_NOPORTS": "Keep in mind that if the public address does not have open ports, you will need to hack the router and from there enter to the local network to reach the victim.",
    "RSHELL_USAGE": "<b>Usage: rshelld [start|stop]</b>\nExample: rshelld start",
    "RSHELL-SERVER_DETAIL": "Install a server to receive reverse shell connections.",
    "RSHELL_INTERFACE_DETAIL": "Terminal interface to interact with the installed rshell server and manage incoming connections.",
    "ING_TITLE_REVERSE_SHELL": "Funny game",
    "ING_REVERSE_SHELL": "Hi!\nYou have to take a look at this game!\nIt is very funny, I have hardly worked today xD",
    "ING_RSHELL_NOCONN": "What you sent me is not working ...\nI get an error message \"rshell_client: IP address not found\"\nWhat is that? It is infected with something weird??",
    "ING_RSHELL_OK": "I just ran it, hope it's gory :)",
    "ING_RSHELL_ROOTUSER": "Are you trying to get the administrator to run a Trojan?",
    "ING_RSHELL_UNK_MAIL": "I don't know your email address and I'm not going to run that thing ...",
    "DOC_METAXPLOIT_RSHELL_CLIENT": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ipAddress\n[2] [opt] <color=#33cccc>int</color> port\n[3] [opt] <color=#33cccc>string</color> procName\n\n<mark=#00D0124D><b>[Description]</b></mark>\nLaunches a process on the victim's machine, which silently tries to continuously connect in the background to the specified address and port.\nFor the reverse shell to run successfully, the <color=orange>rshell</color> service must be installed and the portforward configured correctly on the machine where the server is waiting for the victim's connection.",
    "DOC_METAXPLOIT_RSHELL_SERVER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nThis method returns a list of shell objects that have been reverse shell connected to this machine.\nIn order to manage the connections received, the <color=orange>rshell</color> service must be installed on the machine that receives the victims' connections.",
    "ERROR_UNKPROC": "unknown error: can't find remote process",
    "DOC_ROUTER_FIREWALL_RULES": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\nReturns a string list with the <color=orange>firewall</color> rules present in the router or switch.",
    "DOC_ROUTER_KERNEL_VERSION": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a string with the version of the <color=orange>kernel_router.so</color> library",
    "DOC_FIREWALL_OVERFLOW": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ipAddress\n[2] <color=#33cccc>string</color> memAddress\n[3] <color=#33cccc>string</color> unsecValue\n\n<mark=#00D0124D><b>[Description]</b></mark>\nDue to a vulnerability in some versions of <color=orange>kernel_router.so</color>, an attacker can bypass the firewall by sending a certain sequence of traffic patterns and disable the firewall rules.",
    "RENT_LOCAL_SERVER": "Thank you for your purchase, your servers are ready!\n\nHere you have the credentials to access in <color=orange>LAN</color> via <color=#0FABFFFF>ssh</color>:",
    "DOC_GENERAL_BITWISE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> operator\n[2] <color=#33cccc>int</color> num1\n[3] <color=#33cccc>int</color> num2\n\n<mark=#00D0124D><b>[Description]</b></mark>\n<color=orange>Bitwise</color> operators are used for manipulating data at the bit level.\n<color=orange>Bitwise</color> operates on one or more bit patterns or binary numerals at the level of their individual bits. \nThey are used in numerical computations to make the calculation process faster.\n\nThe operator argument accepts the following operators:\n&, |, ^, <<, >>, >>>\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\nresult = bitwise(\"&\", 12, 25)\npr<color=#33cccc>int</color>(\"Result: \" + result)\n\n#Output\nResult: 8\n</font>",
    "CHAT-SERVER_DETAIL": "Install a chat server that can be configured as public or private.",
    "DOC_FILE_SET_OWNER": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> ownerName\n[2] [opt] <color=#33cccc>int</color> isRecursive\n\n<mark=#00D0124D><b>[Description]</b></mark>\nApply a owner to this file. By default, the owner does not apply recursively. To apply the owner recursively, the optional parameter must be 1.\n",
    "ING_TITLE_CCTV": "CCTV access required",
    "ING_CCTV": "Hello <NAME_ADMIN>.\n\nFor a while now, things have disappeared from the office from time to time.\nWe need access to the camera at <LOCAL_IP> to see if we find anything unusual these days.\n\nThank you. <NAME>",
    "ING_INVALID_CCTV_IP": "There is no camera at that address, check it again.",
    "ING_CCTV_OK": "The password is <CCTV_PASS>\nIf you need help let me know and I'll go there.",
    "LAUNCH_PATH": "<mark=#00D0124D><b>[Parameters]</b></mark>\n<color=#33cccc>None</color>\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> with the original path of the script launched in the terminal.",
    "ERROR_CORRUPT_LOG": "\"Unknown Error: The content of this log is corrupt.\n\nIf you are using a community translation, it is possible that an error in the translation of this file has caused this problem.\"",
    "CONV_CASUAL_02": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"Hey! congratulations on the new job\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Thanks! II have been trying to land a gig like this for some time now\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"So.. Is the pay any better compared to the previous one?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hahaha that's private man!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"That's a yes xD\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Okay, yes xD\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"That said, it has its downsides...\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Why?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"My boss is a jerk\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What boss isnt??\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Man, if you only knew... This guy is a piece of work, a proper idiot!\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"He keeps asking me for stupid things that in the end he wont even use, he is totally incompetent, and while my time is wasted on his whims, I end up without the time needed to finish the tasks that I was initially assigned\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"If it were not for him, it would be the perfect job\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I would not worry too much man, if he's so incompetent, before long, he might end up working for you\"\n  }\n]",
    "CONV_CASUAL_03": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Mmmm How do I download this?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Well, click to download\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"haha, there's a huge button there!\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"-.-\"\n  }\n]",
    "CONV_CASUAL_04": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"What a party yesterday!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Yes, it was not bad\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"not bad??\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I did not flirt with anyone... :(\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Ha! what a sucker\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Idiot\"\n  }\n]",
    "CONV_CASUAL_05": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hey, have you already placed the order?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Mmmm?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"ah yes!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"everything ok ;)\"\n  }\n]",
    "CONV_H_MISSION_1": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Have you gone to work? I haven't seen you all day.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"The boss couldn't access the network from his office and I've been working all day trying to find out what was going on.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Uhh that sucks\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I tell you, it seems that he is always angry, and before he received a call from his wife and it was a very strange conversation.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"What a gossip you are\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I couldn't help but hear it!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"We were in the same room.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I don't know what she said, but he used to say things like you know what will happen to you if you dont do it and things like that... it was very strange\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Wow... come on, sure it has a reasonable explanation, maybe he was joking\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I don't think that guy ever played a joke in their life.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I admit it's creepy\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"And what was wrong with his computer at the end?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"ah, nothing, the guy changed his IP to $IP_LOCAL_IDX1 without telling me and he had misconfigured a lot of things\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"haha a productive day for both of you\"\n  }\n]",
    "CONV_H_MISSION_1B": "[\n    {\n      \"idNpc\": 1,\n      \"text\": \"I already told you that I am not going to do it!\"\n    },\n    {\n      \"idNpc\": 0,\n      \"text\": \"Well, you know what will happen.\"\n    },\n    {\n      \"idNpc\": 0,\n      \"text\": \"Either you withdraw the police report or you will not see them again.\"\n    },\n    {\n      \"idNpc\": 1,\n      \"text\": \"Stop saying that! You wouldn't dare hurt the children!\"\n    },\n    {\n      \"idNpc\": 0,\n      \"text\": \"Try me\"\n    }\n]",
    "PDF_MISSION_02": "<b> Shopping list </b>\n\n- Shovel\n- Rope\n- Saw\n- Gag\n- Rat poison",
    "CONV_H_MISSION_2": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"Is everything ready?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"How are you going to do it??\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I've told you a thousand times not to talk here\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I'm starting to regret this...\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Okay, calm down, now I'm working, but I'm going to connect to my home computer which is more secure and we talk\"\n   }\n]",
    "CONV_H_MISSION_2B": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"I'm already connected, what's wrong?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I'm very nervous... do you know how you're going to do it?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Yes, damn I have already bought what I need and it is already done, it has been fast as we agreed.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Already?? this has gone very fast, I thought you were going to do it in a few days.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I already warned you that there was no going back and you told me okay.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I saw an opportunity to do the job cleanly and I took it.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"So it's...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Dead yes, as you wanted\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"What the hell is wrong with you?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"By the way, I remind you that you have to pay me. I don't think you have problems with what they are going to give you for the life insurance\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"When I receive it I will pay you and we will never speak again.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I hope so\"\n  }\n]",
    "CONV_TEST2": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Esto es una prueba, el nombre es $NPC_IDX0\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Pues si, soy yo\"\n  }\n]",
    "CONV_H_MISSION_3": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hey! Do you already have the ticket?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Now I was going to get it, and you?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I already have it xD\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"The party looks good\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What is the website? I can't find it now\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I think they finally changed it here: $IP_IDX1\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Ugh the tickets are a bit expensive :(\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"It's going to be worth it, trust me ;)\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Do you know anything about $NPC_IDX1?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"From what I've heard, it looks like he's going to the party too\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Have you fixed your problems or are you going to ruin the party as usual?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Our problems as you call them have a lot to do with you, don't forget it\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Again with that shit?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Leave me out of this, now I'm with you and that's it, if he can't overcome it, it's his problem\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"If you keep giving importance and playing along, this is never going to end\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I don't know how many times I've told you\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"We talk later, I have to do things\"\n  }\n]",
    "CONV_H_MISSION_3B": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"As always, you two had to put on the show and get kicked out from the party!\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I can't take this anymore\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"We need to talk seriously!\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Where have you been? I lost track of you after the police arrived\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Hello?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Are you there?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"You're starting to worry me\"\n   }\n]",
    "FILE_MISSION_3": "11:00 - Reported serious aggression\n11:10 - Security manages to control the situation. 3 individuals involved. Two of them fought while the other tried to separate them. Knife present.\n11:30 - The police are called and the individuals are retained.\n11:45 - The police arrive and identify the individuals involved in the altercation as <b>$NPC_IDX0</b>, <b>$NPC_IDX1</b> and <b>$NPC_IDX2</b>\n11:50 - A struggle occurs when the police tries to arrest two of the individuals.\n12:00 - <b>$NPC_IDX0</b> and <b>$NPC_IDX1</b> manage to escape from the police.\n12:10 - The party is closed and proceed to evict the building.",
    "FILE_MISSION_3B": "-----------------------\nName:   Elisabeth Villarreal\nIP:         44.232.255.242\nTickets: 2\n-----------------------\nName:   Mohamed Booker\nIP:         229.17.156.165\nTickets: 3\n-----------------------\nName:   Richard Gilliam\nIP:         186.117.213.107\nTickets: 1 \n-----------------------\nName:   Nick Brooks\nIP:         135.147.182.126\nTickets: 2\n-----------------------\nName:   Toby Flenderson\nIP:          61.80.133.212\nTickets: 1\n-----------------------\nName:   Byron Mackay\nIP:         191.43.182.171\nTickets: 2\n-----------------------\nName:   Mitchell Cameron\nIP:         179.118.107.132\nTickets: 1\n-----------------------\nName:   $NPC_IDX0\nIP:         $IP_IDX0\nTickets: 1\n-----------------------\nName:   Mehmet Guerrero\nIP:         98.156.38.140\nTickets: 1\n-----------------------\nName:   Chaya Sanders\nIP:         58.219.40.87\nTickets: 4\n-----------------------\nName:   Magnus Salinas\nIP:         37.195.153.56\nTickets: 1\n-----------------------\nName:   Taslima Chambers\nIP:         183.149.222.46\nTickets: 1\n-----------------------\nName:   $NPC_IDX2\nIP:         $IP_IDX3\nTickets: 1\n-----------------------\nName:   Melanie Cullen\nIP:         29.184.2.122\nTickets: 2\n-----------------------\nName:   Steven Church\nIP:         254.87.34.36\nTickets: 1\n-----------------------\nName:   $NPC_IDX1\nIP:         $IP_IDX2\nTickets: 1\n-----------------------\nName:   Paloma Mcghee\nIP:         24.244.238.119\nTickets: 1\n-----------------------\nName:   Humphrey Hilton\nIP:         40.223.134.154\nTickets: 2\n-----------------------\nName:    Reese Hopkins\nIP:          84.105.80.118\nTickets: 1\n-----------------------",
    "CONV_H_MISSION_3C": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"Hey, do you know anything about $NPC_IDX0?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"We haven't spoken in a couple of days\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Did something happen?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Yesterday we went to the party and $NPC_IDX1 was there when we arrived...\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"O_o\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Let me guess... did they fight again?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Yes but this time it was very serious, there was a lot of blood on the floor ... I'm going to have a panic attack\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"WHAT??\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I'm going to your house, wait for me\"\n   }\n]",
    "CONV_H_MISSION_3D": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"Are you there?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"You have to help me, I screwed up\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"??\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Do you remember $NPC_IDX0?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"How can I not remember? You're always talking about him\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"What have you done?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Yesterday we fought at a party, I made an ugly cut in his hand, the cops came and everything\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"We managed to escape and after talking a bit we were going to make peace, but he told me something that pissed me off a lot and I ended up stabbing him several times\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I think he's dead, lying on the street two blocks from my house.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"What do I do!! Help!!!\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Fuck you, I don't want to know anything about this stuff.\"\n   }\n]",
    "CONV_H_MISSION_4": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"Hi! I just got to town\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Are you busy? I invite you a beer.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Wow, how long has I not heard from you?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I have interesting things to tell you, in fact I invite you to that beer\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Ha! Are you inviting things?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What poor devil are you plucking this time?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"A loser I'm hacking, I've got his bank account number\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I don't know if I believe you but as long as you buy that beer I don't care xD\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I'm not fooling you, here is the address of the guy $IP_IDX1 and Lan IP $IP_LOCAL_IDX1\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I would need some evidence to believe you xDD\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Well, where do we meet? and you tell me more\"\n  }\n]",
    "CONV_H_MISSION_4B": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"It may seem like a strange question...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Do you know someone who is an expert in computer security?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \":O\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"No, sorry.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What happened?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"There is a guy who hacked me several times...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I have formatted the system but the guy keeps coming in\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"The last straw was that he discovered my bank password and stole money from me\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Uff ... That's very serious\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Have you called the police?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"No... the guy blackmails me saying that if I tell the police it will be much worse\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"he says he has friends like him, and they won't hesitate to come after me if I report him\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What operating system do you use?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"The one almost everyone uses, Ellipse\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I would plan to change the operating system in your place... lately it has a reputation for being insecure\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Maybe that guy is bluffing and is just a kid using some code that he has found on the net\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I don't know if installing another operating system will solve the problem, but I guess I don't lose anything by trying\"\n  }\n]",
    "CONV_H_MISSION_4C": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hello it's me again\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"xDD\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"...\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Why don't you leave me alone?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Are you such an idiot that you still haven't figured out who I am?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I don't understand anything\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I know you?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Tell me who you are and why don't you stop hacking into my computer.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I am $NPC_IDX0\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Nothing?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"We worked together in the same company for 10 years.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Until you decided to spread the rumor that I hit my children and I don't know what other crazy things\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"You knew that when they were about to choose one of the two for the promotion, they weren't going to wait for everything to clear up\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Well, congratulations Mr. CEO, you also got me fired\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I don't know what you're talking about\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"We know each other very well and we both know it was you.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Do you have evidence of that?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Of course not\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"But I assure you that you will regret this\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"At the moment I have managed to access your bank account and have made some transfers\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I'm going to call the police\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I do not recommend it, I have found some documents on your computer that can get you in some trouble with the police\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Tell me what you want\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Don't worry, as soon as I finish the list I will send it to you.\"\n  }\n]",
    "FILE_MISSION_4": "Human Resources - Case File #28\n--------------------------------\n\nInappropriate behavior by $NPC_IDX1 towards another employee is reported to the head of human resources during the quarterly company party.\n\n# Serious misconduct added.\n# Serious misconduct removed from the registry.\nSigned: $NPC_IDX1\n\nHuman Resources - Case File #29\n--------------------------------\n\nA third person reports to human resources that an employee has been experiencing ongoing sexual harassment from $NPC_IDX1.\nThis person is persuaded to report it to the police in exchange for an economic agreement. \nIt is strongly recommended that $NPC_IDX1 be fired after the fiscal year ends and the CTO temporarily takes over.\n\n# Serious misconduct added. Contract review pending.\n# Serious misconduct removed from the registry.\n# Contract review canceled.\nSigned: $NPC_IDX1\n\nHuman Resources - Case File #30\n--------------------------------\n\nHead of Human Resources moved to West Branch. While a replacement is being found, $NPC_IDX1 will take over as head of human resources.\n\nSigned: $NPC_IDX1",
    "FILE_MISSION_5": "$IP_IDX1",
    "FILE_MISSION_5B": "<b>Book of Pointed Heads</b>\n\n...And the clouds will drop to the ground and the sky will turn black in an eternal night.\nOnly those who walk hand in hand with the King of shadows will be able to pass through the temple of truth and create a new world.",
    "FILE_MISSION_5C": "<b>Book of the Inverted Eye</b>\n\n...The end is near, only the chosen ones will meet with the King of shadows to start the new world.\nOnly those who have opened their eyes to the truth of the universe can understand the transformation that is going to take place, and only these can be the owners of the new world.",
    "FILE_MISSION_5D": "Group #1 - Income\n------------------\n\nKirstie Sullivan - 250$\nTaio Lester - 1500$\nBret Durham - 800$\nRaul Knapp - 420$\nMadison Emery - 350$\nWinnie Wall - 518$\nJosef Sykes - 2750$\nAaron Blundell - 125$\nJacqueline Webber - 2110$",
    "CONV_H_MISSION_5": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"We already have one more\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Perfect, so are we already 100?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Yes, we are ready\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"This has become very easy with social networks haha\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Let's get more people\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"NO\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"If the group gets too big we will attract attention\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Remember, this is a fucking sect, our goal is not to succeed in social networks and get likes, asshole\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I know, I'm just saying that with more people we will make more cash without having to repeat the damn loop of the acid ceremony and that, then wait several months and start again\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Do you think it is easy to make 100 people disappear without being caught by the police?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"That's why I say it. We will not be able to repeat this many more times, I think the best thing is to do a last ceremony with more people and disappear for a long time with all that money.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I have to think about it\"\n  }\n]",
    "CONV_H_MISSION_6": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"Hey, do you know if $NPC_IDX0 got fired?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"He has not sent any email advising that he is sick and he has not been here for days.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"No way, they just put him in charge of restructuring sales.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I know, I was supposed to talk to him to join the new team, but I don't know anything yet.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I just went to his cubicle, and his computer is still on and his things are still there.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"The one with the address $IP_LOCAL_IDX1 if I'm not mistaken.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"yep, you should ask those above to see if they know something.\"\n   }\n]",
    "CONV_H_MISSION_6B": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"I got all the data as you requested.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"It was a good job.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"We have created an SSH account for you on a private server at $IP_IDX2, there you have more information about the next steps.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Great, so am I already part of Sentinel?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"It doesn't work like that.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Follow the instructions and don't ask questions.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"But I'm on your side, I support your cause 100%\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"There is no cause, we may have made a mistake with you.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Okay okay, no more questions.\"\n   }\n]",
    "FILE_MISSION_6": "You've come a long way, but you still have one last chance to regret it.\n\nIf you want to continue, there is no turning back. Anyone who collaborates with us must keep a low profile, this means that you must leave your job, your family and friends, everyone. Without goodbyes, go away. We take care of the rest.\n\nIf you want to forget all this and get on with your life, now is the time to do it. Just stop reading, delete this user and you will never hear from us again.\n\nDon't go to work tomorrow.\nTake the first bus that leaves the city from 8:00 onwards.\nSit at the end of the bus.\nAfter several stops, a woman with a tattoo of a chess horse will board the bus.\nGet off at the same stop as her and follow her at a distance of a few meters.\nShe knows you are following her, but DO NOT talk to her.\nYou will arrive at a parking lot where a car will be waiting for you, from there they will take you to your new home.\nAt home you will find your new identity data and a computer, connect to this computer from there to receive the next instructions.",
    "FILE_MISSION_7": "Open the package on the bed.\nTake the car and go to the address written on the device that was in the box.\nThe house uses a digital lock, stay close to it with the device in your pocket until it vibrates three times in a row.\nThe door will have opened, go up to the first floor and enter the room at the back, on the right.\nInside there will be a desk, in the first drawer you will find a folder with the title <i>Energy Plan</i>\nTake it and get out of there.\nContact when you are at home.",
    "CONV_H_MISSION_6C": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hello?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I just arrived\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Something has gone wrong\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Inform\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"How?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What happened\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"You didn't tell me there was a guy in the house!\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"It was some kind of bodyguard or something like that\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"or so it seemed from his clothes\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"that guy was watching something, he didn't live there\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"All that is irrelevant, what happened?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Irrelevant? He almost killed me!\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"He was huge! He hit me several times and at the end I hit him on the head with something heavy, I don't know what it was, it was dark\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I think he wasn't breathing, I panicked and got out of there\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Do you have the folder?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"No\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I did not get to go up to the first floor, there was a huge noise with the fight and I left\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Our relationship is over. We will never speak again.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"But what...?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"It was your fault!!\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"You should have known there was going to be a guy there, and now it's my fault?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hey!\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hello?\"\n  }\n]",
    "MISSION_UNKNOWN_ERROR": "Unknown error: The mission does not exist.",
    "CONV_H_MISSION_7": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"I need to ask you a question bluntly\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Wow, hello to you too\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"It was you, right?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"No one else knew the SSH password except you\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Yes, it was me. You should have changed the password.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Sorry, it's nothing personal.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"For me it is, you know how much I've worked on this.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I understand that you want revenge.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"If I had been fired in the same way I would be very pissed off.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I repeat that it is nothing personal.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"There was no other way to do it but by stealing the project.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"And did you also have to delete it?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Yes.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Leave it alone, nothing is going to happen to you.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"What do you mean?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"They don't trust me, they think we're in league somehow.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I may be fired.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I'm going to say you have done it.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"In your place I would think it over before doing it, because I can say that you have helped me\"\n  }\n]",
    "CONV_H_MISSION_7B": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"I already got the file, they hadn't changed the server password yet.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Well, everything correct then?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Not quite, the file is in binary format and I don't know how to read it.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Okay, try to hurry, the presentation is next week and we need that data.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"By the way, they didn't realize you stole it, did they?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Our company cannot be involved in any scandal, if they can prove that we have stolen the technology, we are going to have problems\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Technically... a person has found out, but if he knows what is good for him he will not say that it was me.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What?? What do you mean technically? Who knows?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"My old co-worker on the project.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"He has deduced that it was me.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Are you telling me that the co-creator of the whole project knows that you just stole it from him?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"You just had to download the data remotely!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"How did he find out?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Because I have deleted the project from the server :)\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"...\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Sorry, I can't believe what I'm reading.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Obviously everyone will find out if the files have been deleted.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Haha of course, the deletion has been my decision as revenge for those rats on the board of directors.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"And as far as I'm concerned, you guys are no better, so screw you.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"A bit naive of you to think that there will be no retaliation for this.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Are you sure? I think the following will happen.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"You're going to shut up your fucking mouth and you're going to pay me double what we agreed to.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I admit that was funny.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"So funny that I am the only person who can access the data in the backup.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Either you tell the police everything, you close the company and someone goes to jail with me. Surely investors have a lot to say about all this.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Get on with work.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"That seemed to me.\"\n  }\n]",
    "FILE_MISSION_8": "Creating testing environment...\nCompiling OS modules... \nFailed! Missing core module.\n\n--- Compilation aborted ---",
    "UI_REPORT_TITLE": "Welcome to the cybersecurity section.\nIf you want to report a crime, fill in the required information and press send. A team will review the report and inform you of its result. Thank you for your collaboration.",
    "UI_REPORT_PUBLIC_IP": "- Enter the public IP of the network where you have found suspicious activity.",
    "UI_REPORT_LOCAL_IP": "- Enter the local IP of the computer with suspicious activity.",
    "UI_REPORT_FILE": "- Attach the file with the evidence of the crime.",
    "TUTO_MAIL_HACK_REV2": "Hi, you do not know me. I monitor new users who register on remote machines like the one you are using.\n\nYou may want privacy for some project you are developing or you may want to earn some money like most people.\n\nIf you are interested I can give you access to my private server but before that I need you to do something for me. You can consider it a test.\n\nI need the credentials of this email address: <b>[EMAIL_ADDRESS]</b>. Belongs to <b>[PERSON_NAME]</b>.\n\nThe mail client leaves a configuration file on the person's computer with the encrypted password, you will need that file to crack the password.\n\nI'll put it easy, the IP address of the victim's computer is <b>[IP_ADDRESS]</b>. I have attached a program that may be useful.\n\nYou may need some legitimate tools, so I recommend that you look for some <b>shop</b> on the net.\nAnswer this email with the password that I need and we will continue talking.",
    "ING_TITLE_BLACKMAIL": "I know it was you",
    "ING_BLACKMAIL": "Hello,\nYou don't know me, but I've found out a few things about you that I'm sure the police will be interested in.\nIf you want me to keep my mouth shut, I advise you to deposit money in my bank account <BANK_ACCOUNT>. I hope it's a generous amount for your sake.\n\nI hope your confirmation.",
    "ING_TITLE_VICTIM_MISSION": "This may interest you",
    "ING_VICTIM_MISSION": "Hello,\nYou don't know me but I think you're having some trouble. and it seems I have found the cause.\nI attached a file with more information.",
    "TOOLTIP_CUSTOM_WP": "To assign a custom wallpaper, you must put images in jpg format in the folder \n<b><WP_PATH></b>\nThen click on the Desktop Wallpaper dropdown to select the image you have included.\n\nIt is recommended to use images with resolution 1920x1080.\nClick on this icon to copy the path to the clipboard of your real computer.",
    "CONV_K_MISSION_1": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"Hey, I already have everything we need.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Cool, that was faster than I thought.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Okay, now what.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Relax, you seem somewhat restless.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What I don't understand is how you are so calm.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I already told you.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"If we follow the plan carefully everything will be perfect.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"A thousand things can go wrong.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hey, if you're going to keep freaking out about all this, now is the time for you to back down.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I can find someone else to help me.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"It's not that... I just want to finish as soon as possible.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Then focus and let's not waste any more time.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I just received by mail the reservation confirmation at the hotel that I told you, it is very close to our destination.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Do you know where it is?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Yes.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Ok, see you there in two hours.\"\n  }\n]",
    "CONV_K_MISSION_1B": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"Thank you for your reservation!\\n\\nYour reference number is RF578JTY.\\nGive this code to the hotel reception.\\n\\nWe hope you enjoy your stay.\\n\\n<i>*(Message sent automatically from $IP_IDX1. Do not reply to this message)</i>\"\n  }\n]",
    "FILE_K_MISSION_1": "- Code <b>JBM80IPZ</b>\n* Payment succesful.\n* $IP_LOCAL_IDX1 assigned to guest room.\n\n- Code <b>RF578JTY</b>\n* Payment succesful.\n* $IP_LOCAL_IDX4 assigned to guest room.\n\n- Code <b>KHY82IPX</b>\n* Payment succesful.\n* $IP_LOCAL_IDX2 assigned to guest room.\n\n- Code <b>MER822UT</b>\n* Payment rejected.\n\n- Code <b>MER822UT</b>\n* Payment rejected.\n\n- Code <b>MER822UT</b>\n* Payment succesful.\n* $IP_LOCAL_IDX3 assigned to guest room.\n\n",
    "CONV_K_MISSION_1C": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"I've been waiting a long time.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Any problem?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I'm coming.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Good\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"The target will arrive in about half an hour.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"We have to be ready by then, dressed, with the balaclava and stuff.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Park the car nearby and when he leaves his car we approach from behind.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Okay.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"You cover his mouth and we put him in the back seat, when I start the car you put the gag on him and tie him up.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Don't be late.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I just got here.\"\n   }\n]",
    "CONV_BK_MISSION_1": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Yeessssss!!!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"???\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Are you okay? xD\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I did it!!!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Come on...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Yes, I just downloaded it\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"By sheer luck in the end I was able to sneak into the system\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Finally xDD\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Are you kidding me?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"NO\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Have you opened it? Send it now!\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Now I was going to execute it, I had to celebrate.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Four days glued to the screen, I almost gave up haha\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Oops wait, somebody knocks the door, I'll be right back.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"How timely, send it to me before opening\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Hey, don't leave me with the intrigue!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"It's not funny, it's been more than an hour.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Are you there??\"\n  }\n]",
    "CONV_BK_MISSION_2": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"We have checked the file and everything is correct.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Was there a problem getting it?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Not too many, the guy had his computer well protected, so we showed up at his house.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"No one will find him.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Perfect, I think the best thing to do is delete the file and upload it to $IP_IDX2\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I think it is not very secure on your server.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"As you like\"\n   }\n]",
    "FILE_MISSION_KB_1": "Laboratory incident report 05L - Confidential\n------------------------------------------\n[Project: Ellipse]\n\n9:00 - All systems online. Main doors for employees unlocked.\n\n9:37 - Meeting for the Interface team is suspended because the subject (Network System Manager Mitchell Gamble) is not present. \n\n10:25 - Subject Mitchell Gamble arrives at the facility and signs in.\n\n10:31 - An alarm is triggered related to physical violence in laboratory 05L.\n\n10:33 - A security team enters laboratory 05L. They report that the subject has attacked several employees and is threatening to injure himself.\n\n10:35 - The subject is attempting to escape the room with several classified company documents.\n\n10:36 - A taser is used to subdue the subject. \n\n10:38 - The security team assumes control of the situation, there are 2 casualties and 4 wounded. The injured, including the subject Mr. Gamble, are escorted to the infirmary.",
    "CONV_WK_MISSION_1": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hello! What are you doing?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Hello love!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Nothing special, I'm finishing picking up some things.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"See you there or do we go together?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"What do you think? :)\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Haha okay, hey by the way, I'm trying to download a file from a website, but it doesn't work.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"hahaha look you're useless ;)\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Don't laugh at me! You know I don't get along with computers ;)\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I was kidding honey, you know I find this adorable!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Sure yes xDD\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Well let's see, what is the website?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I want to download the nmap program to see if my computer is safe\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"This is the web $IP_IDX1\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Can't download a file and want to use nmap?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Don't do anything, I'm going to your house xDD\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Haha, I love you!\"\n  }\n]",
    "CONV_WK_MISSION_2": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"Hi! How long have I not heard from you!\\n\\nI'm going to the city this weekend to buy some things and I thought we could go for a drink and we catch up on the latest gossip: P\\n\\nI suppose everything is fine right?\\nTell me what you think about seeing us!\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"How happy it makes me to read you!\\n\\nAt least you could call from time to time, since you hardly drop by here: P\\nI think it's a great idea, I'm looking forward to seeing you, I have many things to tell you.\\n\\nIn advance I will tell you that I am happy with my partner and we have very cool short-term plans! \\nWe have to decide the day, but it has to be soon! \"\n  }\n]",
    "CONV_WK_MISSION_3": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"Hey, you're taking a long time, are you coming or what?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Don't make me write while I'm driving :)\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I'm almost there.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I already have the tickets by the way, so we can go tonight\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Yay!\"\n   }\n]",
    "FILE_MISSION_KW_1": "[Plane tickets confirmation]\nOrder: 0065878546WTG\nDestination: Bora Bora\n\n\n- 2x adults:\n* Seats: 1G-2G\n\nName: $IDX_NPC0\nName: $IDX_NPC1",
    "FILE_LORE_1": "In 1972, the UNIX operating system was rewritten in the programming language C, opening the possibility for other programmers to create their own operating system variants. \n\nDuring the following years different companies bought licenses in order to distribute their own versions of the operating system. Despite the great popularity of Linux after its creation in 1992, and despite it being open source, it was eventually surpassed by a similar operating system with certain peculiarities.\n\nIn 1994 the company Neurobox published its closed source operating system called Ellipse along with an SDK. To date, the names of the programmers behind the project have not been made public. Although the system was initially derived from UNIX, the changes to the source were so substantial that it is now considered a system similar to UNIX, rather than a branch of it.",
    "FILE_LORE_02": "Last Thursday night, the murder of Jessie Rees, a computer programmer linked to the development of the popular Ellipse operating system, was reported. \n\nAlthough Neurobox never made the names of the people involved public, police investigators suspects that Jessie Rees was affiliated with the company for several years. \n\nThe police are not sharing any other details at this time, but this investigation could potentially expose new information about this secretive company and its popular operating system.",
    "FILE_LORE_03": "Every time Jessie Rees is talked about, more questions arise about what really happened.\n\nNeurobox quickly dissociated itself from the problem, police said that after a \"thorough\" investigation nothing had been found that could link the company to the death of Jessie Rees. This was only two days after.\nThe case was eventually closed as a suicide, although there was some evidence that did not fit, such as that the handwriting on the note did not correspond to Rees' handwriting, as well as the glass that had recently been replaced in the front door.\n\nHe was hired by Neurobox and moved into the facilities they have available to employees. According to some documents found in Rees' house, this seems to have been an essential requirement to be able to work in the company.\n\nAs it was later revealed, Rees had been one of the engineers in charge of designing the Ellipse kernel, but certain problems with the company, the details of which have not been disclosed, led to his dismissal shortly before Ellipse was released to the public.",
    "CONV_CASUAL_06": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"I'm sick of the damn Ellipse\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \": :O what happened?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Viruses and hacks, that happened.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I have lost important data, I would use another operating system, but some programs that I need do not work on other OS\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Do not think that it will be very different in other OS\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I suggest you remove the read and write permissions on folders where you do not want other users to access.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"For example you can use chmod -R o-rwx folderpath\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hmm.. interesting. And what does this do exactly?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Makes other users except you read and write to that folder.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Oh thank you... done.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"If you need more help ask me whenever you want\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Thanks again!\"\n  }\n]",
    "CONV_H_MISSION_8": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"Hey man, something strange is happening on my computer xD\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I already told you not to install things from unknown places... heh\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Can you take a look and see what's wrong?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I have opened the ssh access in $IP_IDX1\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Same user and password as usual\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Uff okay, I'm going to check it later, but this is the last time.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Thank you!\"\n  }\n]",
    "CONV_H_MISSION_8B": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"How's the fishing going? xD\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Another one haha\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I'm just trolling him at the moment, but I think he'll pay when I install the ransomware\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"We continue 25/75 with the distribution of the profits, right?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Yes, and you take too much for what you do.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I'll send you the money later.\"\n  }\n]",
    "CONV_CASUAL_07": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \":O :O\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Are you watching the news?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Yes, the Sentinel thing\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Omg, was it really them? Have they confirmed it?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I'm freaking out, it seems like they were.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I don't know what to think.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Well... I don't think anyone would pretend to be them, after what happened last time\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I didn't know that, what do you mean?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Buddy, the bank thing\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What bank?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"It was super viral, some guys robbed a bank leaving unsubtle clues trying to blame Sentinel and such, I'm not sure what they were trying to achieve with that.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"The point is that in a matter of a few days, all the members of the robbery were handed over to the police by real members of Sentinel. The same week of being incarcerated, they all died on the same day and at the same time\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Cyber-curse?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Haha well at the beginning it sounded like this, each one was killed by other prisoners, but clearly Sentinel wanted to send a message, as if they were everywhere. Not only that, but later it has been known that direct relatives with the robbers have suffered great misfortunes, such as suspicious deaths, drug addiction, etc. But well, that could be a coincidence, in any case, it seems that it worked, no one else has thought of pretending to be them. \"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Uff they are not what I thought...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I was surprised that you were so surprised xD everyone knows that it is not the first time they have killed.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"But hacking the military drones and killing all the soldiers at the base I don't think is the solution.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Don't try to make much sense of what they do.\"\n  }\n]",
    "CONV_CASUAL_08": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"Hey! I've been waiting for you for 30 minutes\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"oops, sorry, right now I'm leaving the house, I've been distracted by something\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"You always get distracted by something\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Sorry sorry, I'm coming\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Well, you're still talking here, turn off the computer!\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \": P\"\n   }\n]",
    "CONV_CASUAL_09": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"Have you already bought it?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Haha yes!\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Are you coming to see it?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Right now I'm going.\"\n   }\n]",
    "CONV_CASUAL_M_01": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Good morning\\n\\nI am not feeling very well today and I am not going to work.\\nCan you tell the others in the office?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"No problem.\\nYou can include them in the mail next time.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Ok, see you tomorrow\"\n  }\n]",
    "CONV_CASUAL_M_02": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Good morning,\\nMy son is not going to school this week due to health reasons.\\nIt is possible that next week he will not be able to attend class either.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Good morning,\\nI wanted to let you know that your child has missed too many classes and some important exams.\\nI suggest that we meet to discuss it to see what we can do.\\nHopefully he get well soon.\\n\\nGreetings. \"\n  }\n]",
    "FILE_LORE_04": "<b>Report Test number 2147 - Qlab 12</b>\n\nAfter solving the refrigeration problem, an average fidelity of 99.996% has been achieved.\n\nIt is expected that we reach an even greater average in the coming months. This can leave any encryption and security model obsolete in a matter of weeks, including ours.\n\nWe are not prepared to open the system and I will insist again to keep these tests in a private environment until we have a secure migration plan.",
    "FILE_LORE_05": "<b>Report Test number 3542 - QLab 04</b>\n\nThe simulations have been impressive. Julia's idea worked to perfection, and we have been able to recreate areas outside the field of vision up to several kilometers with 99.78% efficiency.\n\nI know this comes out of the initial goal we had on the project, but I think it would be interesting to see how far we can go.\n\nI understand the ethical problems that this presents but we can not ignore what we just got.\nWe are waiting for confirmation to continue with the tests.",
    "CONV_CASUAL_10": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"I didn't see you in the canteen today.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I fell asleep :)\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"How long have you been here, by the way?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Time seems to pass faster here locked up.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Haha, I agree.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I've been here for about two years, but eventually you get used to it.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I don't know how long I'll be here, it seems crazy to me that we can only go out twice a year.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"You know, but I doubt that you will find this salary in another company.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I know... I know :)\"\n   }\n]",
    "CONV_CASUAL_11": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"Are you still trying?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Of course.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Stop wasting time, it's impossible, you know.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Give me some more time.\"\n   }\n]",
    "CONV_CASUAL_12": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"I have seen that we only have access to our section.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I find it a bit strange that there is so much security around here and so much closed access.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Why can't I talk to graphic designers for example?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What security problem is there with me interacting with the person who designed the folder icons? xDD\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"They consider us little more than visitors, have you seen our access level of the cards?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Ridiculous haha.. We are here to work on the weekly security patches and that's it.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I hadn't thought of it that way, maybe you're right and they're only delegating work that they consider secondary to people like us who can then fire whenever they want without us being able to tell anything confidential.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"It makes sense, but it seems excessive to me...\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Anyway, we'll talk later, I just got eight new reports all at once :/\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Ouch, okay, see you later. Good luck with the fix\"\n  }\n]",
    "DMISSION_CRED_USER": "The client wants the login credentials of the user $USER.",
    "DMISSION_CRED_ANY_USER": "The client wants the login credentials of any user on the remote machine.",
    "DMISSION_BODY_CRED": "The remote ip of the victim is $PUBLIC_IP. It's important that you access the correct machine behind the public ip. The victim's ip LAN is $LOCAL_IP",
    "DMISSION_BODY_ACADEMIC": "Client wants to change some grades in his academic record. The remote ip of the victim is $PUBLIC_IP\nThe LAN address where the database is located is $LOCAL_IP\n\nIf you can not access directly, you can try to access through a teacher's computer in the local network.\n\nThe record to modify belongs to: $NPC_NAME.",
    "DMISSION_ACADEMIC_APROVE": "Client wants to modify the subject $SUBJECT to change the note to approved at least.",
    "DMISSION_ACADEMIC_IMPROVE": "Client wants to modify the subject $SUBJECT to increase the academic qualification by at least one point.",
    "DMISSION_POLICE_BODY": "The client wants to modify the information of a police record.\nThe remote ip of the victim is $PUBLIC_IP\n\nThe record to modify belongs to: $USER",
    "DMISSION_DESTROY": "The client wants the remote machine to stop working.\nThe remote ip of the victim is $PUBLIC_IP. It's important that you access the correct machine behind the public ip. The victim's ip LAN is $LOCAL_IP\nBe careful since the administrator will want to know who was responsible.",
    "TUTO_RESET_INFO_01": "You can only reset the tutorial mission if you have already completed it.",
    "TUTO_RESET_INFO_02": "To start the tutorial you need to have registered an email account.",
    "MISSION_STEAL_FILE_TITLE": "Get remote file",
    "MISSION_STEAL_FILE_CONTENT": "The client wants you to enter a remote machine and get a file that contains important information for him.\n\nThe remote ip of the victim is $PUBLIC_IP and the LAN address where the file is located is $LOCAL_IP on the path $FILE_PATH.",
    "MISSION_STEAL_FILE_PREVIEW": "The client wants you to get a file from the victim.",
    "DMISSION_DEL_FILE_02": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"So are you sure you're okay?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Yes, don't worry, it only hurts when I move my arm.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"But the doctor says he should be heal without problems in a few weeks.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"You're lucky it wouldn't have been much worse.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"At least I have its license plate, a witness has sent me a photo of the car at the time of the accident.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Just in case I have encrypted it and saved it in $IP_LOCAL_IDX1\"\n   }\n]",
    "DMISSION_DEL_FILE_04": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"We already know who he is :)\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Caught! xD\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Do I know him?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I don't think so, I don't know him either, but his face can be seen perfectly in the video.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Haha, I already told you it was a good idea to install a surveillance camera.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Thanks for the tip!\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"While preparing the paperwork for the trial, I have encrypted the video and saved it in $IP_LOCAL_IDX1\"\n   }\n]",
    "DMISSION_DEL_FILE_05": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"So are you sure you're okay?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Yes, don't worry, it only hurts when I move my arm.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"But the doctor says he should be heal without problems in a few weeks.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"You're lucky it wouldn't have been much worse.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"At least I have its license plate, a witness has sent me a photo of the car at the time of the accident.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Just in case I have encrypted it and saved it in $IP_IDX1 on the LAN $IP_LOCAL_IDX1\"\n   }\n]",
    "DMISSION_DEL_FILE_06": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"We already know who he is :)\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Caught! xD\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Do I know him?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I don't think so, I don't know him either, but his face can be seen perfectly in the video.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Haha, I already told you it was a good idea to install a surveillance camera.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Thanks for the tip!\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"While preparing the paperwork for the trial, I have encrypted the video and saved it in $IP_IDX1 on the LAN $IP_LOCAL_IDX1\"\n   }\n]",
    "MISSION_DEL_FILE_TITLE": "Find and delete remote file",
    "MISSION_DEL_FILE_PREVIEW": "The client wants you to delete a file that could incriminate him in a crime.",
    "MISSION_DEL_FILE_CONTENT": "The client wants you to delete a file that could incriminate him in a crime.\n\nThe name of the file is unknown, but it is possible that it is at the $PUBLIC_IP address in the LAN $LOCAL_IP. If the file is not there, look for information that can indicate where it is.",
    "DMISSION_DEL_FILE_01": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"So are you sure you're okay?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Yes, don't worry, it only hurts when I move my arm.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"But the doctor says he should be heal without problems in a few weeks.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"You're lucky it wouldn't have been much worse.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"At least I have its license plate, a witness has sent me a photo of the car at the time of the accident.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Just in case I have encrypted it and saved it in my computer.\"\n   }\n]",
    "DMISSION_DEL_FILE_03": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"We already know who he is :)\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Caught! xD\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Do I know him?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I don't think so, I don't know him either, but his face can be seen perfectly in the video.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Haha, I already told you it was a good idea to install a surveillance camera.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Thanks for the tip!\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"While preparing the paperwork for the trial, I have encrypted the video and saved it in my computer\"\n   }\n]",
    "CONV_K_MISSION_2": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"Hi! I noticed you were a little worried the last time we spoke.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I had an important appointment and I couldn't ask you at the time\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Is everything okay?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Thanks, don't worry, teenage stuff I guess.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Oh, I hope your son is okay.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I don't know... I suspect he is using drugs but I have no proof.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Oh no...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I've noticed a change in his personality lately, and he often comes home smelling funny.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Do you think he's smoking something?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"That's what I suspect, but I've never seen him act weird, even when he's spouting that stink.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Although it is not very ethical, maybe you should go into his computer to see if you find something that confirms your suspicions.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"You may be right...\"\n  }\n]",
    "FILE_MISSION_K_1": "Invoice number: D221126398\nReference: 38254322\n\nMonthly fee: $42 --- 50Mb\n\nAssociated IP address: $IP_IDX1",
    "CONV_K_MISSION_2B": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"New clients keep coming xD\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I did not expect us to do so well :)\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"That guy with the huge glasses asked me for 20 grams, I told him that we would see each other tomorrow.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"We shouldn't talk about this around here.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"You are right, I have uploaded a document with the orders of the week in the ftp server\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Remember to delete it when you have everything ready.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"ok, I'll let you know.\"\n   }\n]",
    "FILE_MISSION_K_1B": "Ramiro Robinson ---- coke x2 bags\nSam Anderson ------ weed x4 bags\nRoy James --------- weed x2 bags\nStacy Farmer ------- mushrooms x1 bag\nMonique Ramirez --- mdma x1 bag\nAlexandra Wade  --- mdma x2 bags\nGlen Thornton   ---- weed x2 bags\nAbel Hunter     ----- coke x1 bag",
    "MAIL_HIDDEN_MISSION": "Hello, I have heard about your skills and I have a certain personal interest in you taking a look at the computer that is on the $PUBLIC_IP network on the LAN $LOCAL_IP. You may find something that may interest you.\n\nI prefer to remain anonymous, so please do not try to contact me.",
    "HIDE_MISSION_REPORT_OK": "We have confirmed that a crime has occurred thanks to the evidence you have sent us.\nAn investigation has been opened to gather more evidence and arrest the suspects.\nThank you for your collaboration.",
    "HIDE_MISSION_REPORT_FAILED": "The file you have sent us does not contain information that clearly states a crime at the address you have reported.",
    "HIDE_MISSION_NOT_FOUND": "The IP address you have reported does not seem to be related to the file you have attached.",
    "CONV_K_MISSION_3": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"$NPC_IDX0 told me to meet without him, he has some things to do...\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I don't think I have seen anyone with such eye bags.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Is he not sleeping or what?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I've tried talking to him but he gets defensive, and says he's fine, just a little stressed out from work.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"And how will he be when he is VERY stressed?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"It is clear that it is not because of work, something has happened recently, I would say that it is some problem of addiction to gambling or drugs perhaps\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"It is true that he is often absent at times without giving explanations.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"If he is not careful they will end up firing him, we will not be able to cover him much more.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Anyway, I think the documents for the meeting are on his computer, at the address $IP_LOCAL_IDX1\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I've already checked, the documents are not there\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Ah ok, sorry I have them here :)\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Okay, let's go\"\n  }\n]",
    "CONV_K_MISSION_3B": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"Perfect, we have received it.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Then that's it, right?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I have done my part.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"haha no\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"We still need a few more things :)\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"That's not what you told me!\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Look, you are in no position to complain or demand anything.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"This will end when we want, or else you know what will happen.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Send the documents of all your clients and projects that you have in development by ftp to the address $IP_IDX2\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Wait for more instructions later.\"\n   }\n]",
    "FILE_MISSION_K_3": "----------------------------\nSummary of projects in development\nConfidential\n----------------------------\n\nAll current contracts have been canceled to direct all resources to project #057851 financed by Neurobox.\n\n[Project #057851] - Active\n\n- Study of the performance of superconductors in extreme temperatures and applications in artificial gravitational fields.\n- Study possible variations of performance in zero gravity.",
    "FILE_MISSION_K_3B": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Well, I already have the document, I was expecting something else.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"But so far it's okay.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"At the moment there is no more work for you, so wait for me to get in touch with you again.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I can't keep filtering information, I can get in trouble...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Not our problem\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Do what you want, I will not continue with this.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Then I guess you don't care if your wife finds out you're cheating on her.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"The perfect top manager fucking his secretary, could there be something more clich?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Maybe your bosses don't approve either.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I don't care, it's better than going to jail.\"\n  }\n]",
    "CONV_K_MISSION_4": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"Has the job interview been today?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Yep, they gave it to me :D\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Very good!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I knew you would get it\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Thank you ^^\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"How does it feel working for one of the largest software companies?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Haha, well I don't know... it's weird I guess\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I'll start tomorrow I'll tell you how it was\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"But first we have to celebrate!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Sure, see you later :)\"\n  }\n]",
    "FILE_MISSION_K_4": "---------------------------\nNeurobox Corp.\nConfidential information\n---------------------------\nContract # 6458\nName: $NPC_IDX0\nSecurity Expert Level 1\n---------------------------\n\nSSH access to your room # 58 computer has been enabled\nIP address: $IP_IDX1",
    "CONV_K_MISSION_4B": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hello, I have been checking the main libraries and have found several vulnerabilities\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"In init.so and net.so\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Thanks for the information but for now we want you to only focus on kernel_module.so\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I have also found some vulnerabilities there\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Ok, you just have to work on kernel_module.so\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"We have other teams dedicated to the other libraries.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"How? It seems a bit excessive to dedicate entire teams just for this. One person could review them all.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Thanks for the suggestion, this has been discussed internally and no changes are necessary.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"At this time we are interested that you only work in the kernel because it is more complex than other parts.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Okay...\"\n  }\n]",
    "CONV_K_MISSION_4C": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"How was your first day?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Not bad I guess\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Did something go wrong?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"No.. it's just that something doesn't fit here...\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"There is a lot of security, you cannot take a step without having to show the employee card.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I think I'll try to sneak into level 2, maybe I could see something interesting\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Be careful, if you don't want to get fired on the first day xD\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Haha, don't worry\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"We'll talk when I get home.\"\n   }\n]",
    "CONV_K_MISSION_4D": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"I have some photos :D\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"From what?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I sneaked into a section of level 2.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"It turns out they have labs but not software labs, but chemicals labs.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"There were also hospital beds and surgical supplies too.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Yes that's weird...\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I'm going to continue researching and I'll post everything I find on my blog\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"That... doesn't seem like a good idea.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"If you get caught breaking your contract in something like this you could go to jail\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Don't worry, the blog is anonymous xD\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"You're crazy, don't say I didn't warn you ;)\"\n   }\n]",
    "FILE_MISSION_K_4B": "$IP_IDX3",
    "CONV_K_MISSION_4E": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"It is already solved, he has closed the blog.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Perfect, I hope there will be no more problems with him in the future.\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I had to resort to some somewhat aggressive techniques to make him come to his senses.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"What? Are you kidding me?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Legal threats didn't seem to intimidate him much, so I've made use of some private information we have about him, you know, hinting that we're watching him and I may have hit him a bit.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Do you think we are some kind of mafia or something?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"If this comes out ...\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"You told me to convince him anyway, and you said it in a way that I thought ...\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Let's talk later\"\n   }\n]",
    "MISSION_FINDHACKER_TITLE": "Find the hacker's computer",
    "MISSION_FINDHACKER_PREVIEW": "A hacker's computer needs to be traced to know his identity",
    "MISSION_FINDHACKER_CONTENT": "An unknown hacker has been stealing confidential information from various companies.\nThe last report was in the address $PUBLIC_IP in the computer $LOCAL_IP.\n\nYou must reach the computer from where the attack started.\nReply to this email with the attacker's public and local IP address.",
    "DMISSION_HACKER_VICTIM": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"I think I was hacked...\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I just checked the logs and there is something I don't like\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Thanks, I just reported it to the security team\"\n   }\n]",
    "DMISSION_HACKER_PC": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"I have already accessed the machine and as we suspected there are several things that interest us.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Perfect, see you later and you tell me in person.\"\n   }\n]",
    "TOOLTIP_MAIL_UNREAD": "Unread mail",
    "TOOLTIP_MAIL_MISSION": "Mission",
    "DELETE_MAIL_QUESTION": "Are you sure you want to delete this email?",
    "CONV_BK_MISSION_3": "[\n  {\n    \"idNpc\": 0,\n    \"text\": \"You won't believe what happened to me\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"What's wrong?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Do you remember I told you that I was going to go hiking this weekend with the dog in the mountains?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Well, walking near a river, Seymour started digging under a tree quite insistently...\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Uuh have you found a body?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Hahaha no! Much better!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"A backpack full of money! Ha!\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"It's certainly better than a corpse...\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Come on, seriously, did you find something or are you kidding me?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Don't waste my time, I have a lot of things to do today\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I swear it's true.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I've counted it several times, exactly 5 million...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I just sent you a photo :)\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"I have thrown the backpack and am putting the money in a more secure box.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"But... that money have an owner, someone will have hidden it there\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"And how are they going to know who it was?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"There was no one when I picked it up.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"OMG I think you're getting into something dangerous.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Do you think that whoever hid it there will not have the means to get to the money in some way?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I would take it to the police, tell them that you have found it by chance and forget about it\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"How exaggerated you are, but I appreciate the advice, I'll think about it :)\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I wouldn't take long to think about it if it were you.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Thanks for the advice, we talk when I get home, I must continue working\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I thought you were going to work from home today\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Yes, I have come to pick some things, the ssh server was not working for some reason.\"\n  }\n]",
    "CONV_BK_MISSION_3B": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"Hey, Did you arrive home??\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"What did you decide in the end?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Hello?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"You should have arrived an hour ago...\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I hope it's not a joke\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Let me know as soon as you read the messages\"\n   }\n]",
    "CONV_BK_MISSION_3C": "[\n  {\n    \"idNpc\": 1,\n    \"text\": \"Good morning Mr. $NPC_IDX0\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Who are you?\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"You are not in my contacts\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"One of my employees has broken into your computer and got me some interesting information\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"I know you well $NPC_IDX0 and I'm sure you already suspect why we're talking right now.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"No.. I don't know\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Think about it, could you have had a stroke of luck recently?\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Maybe something was found by chance...\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"That's right.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"Very well, I want to personally thank you for taking care of my things, and I need you to return it to me.\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Of course\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"In two minutes there will be a car waiting for you at your door.\"\n  },\n  {\n    \"idNpc\": 1,\n    \"text\": \"And don't forget the money\"\n  },\n  {\n    \"idNpc\": 0,\n    \"text\": \"Ok\"\n  }\n]",
    "CONV_BK_MISSION_3D": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"How did it go?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Do you have the money?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Yes, I do, although something unexpected happened.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"He has insisted all the trip to work for you, he says he has experience as an accountant and could launder money for us\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I told you to kill him as soon as you had the money\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Okay.. shall I kill him then?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Anyway, we may need him, bring him here.\"\n   }\n]",
    "CONV_WK_MISSION_4": "[\n   {\n     \"idNpc\": 1,\n     \"text\": \"Hey I'm thinking of changing my CPU\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I'm seeing prices here $IP_IDX1\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"What do you think?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Maybe you should wait a little longer for the new models to come out.\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"You may be right...\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"By the way, look what I bought!\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"How, did you buy a katana? haha\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"I've wanted one for a long time, will you come home and see it?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Then we can have something for dinner there\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Okay, I'm going there.\"\n   }\n]",
    "CONV_WK_MISSION_4B": "[\n   {\n     \"idNpc\": 0,\n     \"text\": \"Hey you have to help me!\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Are you okay?\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"NO!\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"Yesterday I was with a friend and I was showing him the sword\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Wait, is that an understatement? Because I don't know if I want you to tell me...\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"No idiot, the katana, the collector's sword\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Oh yeah, right, and what... happened\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I went to catch it from the wall support, but my foot slipped and I fell on top of him with the sword in hand...\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I hit him in the face, I think he's dead... you have to help me bury him somewhere\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Are you crazy?\"\n   },\n   {\n     \"idNpc\": 1,\n     \"text\": \"Call the police\"\n   },\n   {\n     \"idNpc\": 0,\n     \"text\": \"I don't know, they won't believe me\"\n   }\n]",
    "MISSION_FINDEV_TITLE": "Find evidence of a crime",
    "MISSION_FINDEV_PREVIEW": "Find evidence that incriminate a suspect",
    "MISSION_FINDEV_CONTENT": "There are suspicions that a person who is being investigated, keeps the evidence of a crime that has been committed on his computer, but we have not managed to enter.\nThe public address is $PUBLIC_IP and the suspect computer has the local IP $LOCAL_IP\n\nFind any evidence that can incriminate the suspect and attach it in the response.",
    "FILE_LORE_06": "Ellipse was conceived to mainly be used in the corporate sphere, and its strengths were security and portability since it was possible to install the system in different architectures with few changes to the code. To achieve this, the whole system was rewritten in a programming language called Greyscript along with its own closed source compiler. Its peculiar implementation made it really difficult to infect or exploit, in part because nobody managed to create a reliable decompiler for Greyscript. \n\nIn a cryptic message released on the web in 1996, the company announced that Ellipse where to be made available for both personal and commercial use completely free without any licensing. The secrecy surrounding Neurobox along with several cryptic messages published by the company, has spawned numerous theories about the companys origin and agenda while also boosting the popularity of the operating system. ",
    "FILE_LORE_07": "In 1998 the first major vulnerability in Ellipse was discovered, this vulnerability had been exploited for months until it was discovered, which led to harsh criticism of the company. Their response was the last public message by the company to date: \n\nEverything under control\n\nLess than 24 hours later a patch was released that fixed the vulnerability. Since then, new vulnerabilities keep appearing, several of which have been connected to corporate espionage and bank heists among other things. To this day the company is stuck in a perpetual cycle of finding and patching these never-ending flaws.\n\nOne popular theory is that Neurobox themselves are behind the security flaws, but what they would have to gain from doing this and why they continue to patch their system if that were the case, remains unclear. Meanwhile, the many years of silence from Neurobox since the hacking surge began, continue to inspire new conspiracy theories about the company.",
    "SMTP-USER-LIST_DETAIL": "Displays the user accounts registered on the server where the SMTP service is running.",
    "DOC_GENERAL_IMPORT_CODE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> absolute_path\n\n<mark=#00D0124D><b>[Description]</b></mark>\nIt imports the contents of the text file indicated on the path parameter. This method is useful for all the code of a program to be distributed between several different files and also to avoid the limit of characters allowed by text file.\n\n<mark=#00D0124D><b>[Example]</b></mark><font=\"SourceCodePro-Regular SDF\">\n//main.src\nimport_code(\"/home/user/my_module.src\")\nprint(\"bye\")\n</font>\nContent of my_module.src\n<font=\"SourceCodePro-Regular SDF\">\n//my_module.src\nprint(\"hello!\")\n</font>\nResult after compiling main.src and launch it\n<font=\"SourceCodePro-Regular SDF\">\n#Output\nhello!\nbye\n</font>",
    "METAXPLOIT_DETAIL": "Library analysis tool",
    "CRYPTO_DETAIL": "Crypto suite library",
    "REPO_USAGE": "<b>Usage: repod [start|stop]</b>\nExample: repod start",
    "REPOSITORY-SERVER_DETAIL": "Install a repository server to host different programs.",
    "APT-GET_USAGE": "<b>Usage: apt-get install [program_name]</b>\n<b>Usage: apt-get search [program_name]</b>\n<b>Usage: apt-get show [repo_address]</b>\n<b>Usage: apt-get addrepo [repo_address]</b>\n<b>Usage: apt-get update</b>\n<b>Usage: apt-get upgrade</b>\n\nExample: apt-get install libssh.so\nExample: apt-get search decipher",
    "DOC_APTCLIENT_ADD_REPO": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> repository_address\n[2] [opt] int port\n\n<mark=#00D0124D><b>[Description]</b></mark>\nAdd the repository address in the <color=yellow>/etc/apt/sources.txt</color> file",
    "DOC_APTCLIENT_INSTALL": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> package_name\n[2][opt] <color=#33cccc>string</color> install_path\n\n<mark=#00D0124D><b>[Description]</b></mark>\nInstall the program or library from a remote repository listed in <color=yellow>/etc/apt/sources.txt</color>.\nUnless a path is specified, the program installs in <color=yellow>/lib</color> if it is a library or in <color=yellow>/bin</color> otherwise",
    "DOC_APTCLIENT_UPDATE": "<mark=#00D0124D><b>[Parameters]</b></mark>\nNone\n\n<mark=#00D0124D><b>[Description]</b></mark>\nUpdate the list of available packages after adding a new repository in <color=yellow>/etc/apt/sources.txt</color>, or if the remote repository has updated its information in <color=yellow>/server/conf/repod.conf</color>",
    "DOC_APTCLIENT_SEARCH": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> package_name\n\n<mark=#00D0124D><b>[Description]</b></mark>\nSearch specifically for the package in any of the repositories listed in <color=yellow>/etc/apt/sources.txt</color>",
    "DOC_APTCLIENT_SHOW": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> repository_name\n\n<mark=#00D0124D><b>[Description]</b></mark>\nShows all packages available in the repository. The repository must be added in the <color=yellow>/etc/apt/sources.txt</color> file.",
    "DOC_APTCLIENT_CHECK_UPGRADE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> file_path\n\n<mark=#00D0124D><b>[Description]</b></mark>\nCheck if there is a newer version of the file in the repository.",
    "APT-GET_DETAIL": "Install new programs hosted in remote repositories and manage updates to any installed programs from these repositories.\nYou can update the Operating System libraries by keeping the <color=#33cccc>official_server</color> option to <color=orange>true</color> from the <color=yellow>/etc/apt/<color=yellow>sources.txt</color></color> file.\n\nAfter modifying the <color=yellow>sources.txt</color> file, launch <color=#0FABFFFF>apt-get update</color> so that the cache information is updated with the available packages.",
    "LIBRSHELL_DETAIL": "Library used in the reverse shell service. It is automatically included with the service installer.",
    "CONFIGLAN_DETAIL": "Tool to manage rented servers.",
    "EXPLOITREPORT_DETAIL": "Tool to report vulnerabilities in system libraries.",
    "FILE_LORE_08": "<b>Transcript Meeting N38.\nBoard of Directors - Neurobox.\nThursday 10/10/1996.</b>\n\nAndrew: Good morning to all, I know this meeting was not planned...\n\nRichard: Can not we have solved this on the phone?\n\nAndrew: I'm afraid no, the security of the operating system has been vulnerated.\n\nJoana: I thought that could not happen.\n\nAndrew: No system is invulnerable but we did not think that they were going to get it so fast\n\nRichard: Is it known publicly?\n\nAndrew: Not yet, we are trying to negotiate with the exploit author so that he does not publish it, but we do not know how long we can buy his silence. In any case we are only gaining time, if a person has achieved, others will achieve it too.\n\nJoana: A lot of money has been invested to develop the system, and in the end it is violated as any other? Are we sure there have been no leaks from an employee?\n\nAndrew: We are investigating it, but it can take some time.\n\nRichard: Now it does not matter, as soon as it goes to light, it will suppose a decrease in the number of users, and the number of users is not growing as planned.\n\nJoana: Well, give away the system for free.\n\nAndrew: How free?\n\nJoana: The important thing here is the number of users, Ellipse was not created to earn money, we do not have problems of funds, do not lose perspective gentlemen.\n\nAndrew: The idea of selling it is to give a vision of quality and reliable product, people give more value to something that has bought than if they have given it to it\n\nRichard: Well, that's a somewhat daring affirmation, Linux is free and its number of users is not much less than in Ellipse.\n\nJoana: Exactly, also that difference of users is because Ellipse promises security and ease of use. I say that we continue gaining time and make sure that people identify Ellipse as a reliable system during all the time we can. We can always make a damage control at the time.\n\nAndrew: I think it's fine, all agree?\n\nRichard: I'll take care of talking to the Marketing Department.\n\nAndrew: Okay, let us know when you have something. I think we can conclude the meeting.",
    "DELETE_THIS": "",
    "DOC_LIBMAIL_LOGIN": "<mark=#00D0124D><b>[Parameters]</b></mark>\nNone\n\n<mark=#00D0124D><b>[Description]</b></mark>\nAccess the email account and returns a <color=orange>MetaMail</color> type object if the login has been correct. In case of error, it returns a <color=orange>string</color>",
    "DOC_METAMAIL_FETCH": "<mark=#00D0124D><b>[Parameters]</b></mark>\nNone\n\n<mark=#00D0124D><b>[Description]</b></mark>\nReturns a <color=#33cccc>string</color> type <color=orange>list</color> of the received emails, with a content preview. In case of error, it returns a <color=#33cccc>string</color>",
    "DOC_METAMAIL_READ": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> mail_ID\n\n<mark=#00D0124D><b>[Description]</b></mark>\nRead the full mail. The mail_ID argument can be obtained with <color=orange>fetch</color>",
    "DOC_METAMAIL_SEND": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> address\n[2] <color=#33cccc>string</color> subject\n[3] <color=#33cccc>string</color> message\n\n<mark=#00D0124D><b>[Description]</b></mark>\nSend a new mail to the indicated recipient. Returns <color=#33cccc>true</color> if the mail has been sent correctly, otherwise returns a <color=#33cccc>string</color> with the error.",
    "DOC_METAMAIL_DELETE": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> mail_ID\n\n<mark=#00D0124D><b>[Description]</b></mark>\nDelete the mail that corresponds with mail_ID. Returns <color=#33cccc>true</color> if it was removed successfully or a <color=#33cccc>string</color> with the error message.",
    "DOC_APTCLIENT_DEL_REPO": "<mark=#00D0124D><b>[Parameters]</b></mark>\n[1] <color=#33cccc>string</color> repository_address\n\n<mark=#00D0124D><b>[Description]</b></mark>\nRemove the repository address in the <color=yellow>/etc/apt/sources.txt</color> file"
  }
}
